{"52282": [["Typical south Indian food , with nice ambience and taste.  Price is decent as the capacity of food is more than expected.  It is run by Kerala cooperative society.  Had been to other outlets in Kerala.", 3.0], ["The Indian Coffee House is a restaurant chain in India, run by a series of worker co-operative societies. It has strong presence across India with nearly 400 coffee houses, but has a clear Kerala connection.The India Coffee House chain was started by the Coffee Cess Committee in 1936, when the first outlet was opened in Bombay. In the course of the 1940s there were nearly 50 Coffee Houses all over British India. It was during the late 1890s that the idea was formed.Due to a change in the policy in the mid 1950s, the Board decided to close down the Coffee Houses. Encouraged by the communist leader A. K. Gopalan(AKG), the workers of the Coffee Board began a movement and compelled the Coffee Board to agree to handover the outlets to the workers who then formed Indian Coffee Workers' Co-operatives and renamed the network as Indian Coffee House. A co-operative began in Bangalore on 19 August 1957, and one was established in Delhi on 27 December 1957. Later Bellary and Madras (Chennai) Societies were separated from their mother societies.", 4.0], ["The Indian Coffee House is a restaurant chain in India, run by a series of worker co-operative societies. It has strong presence across India with nearly 400 coffee houses, but has a clear Kerala connection.The India Coffee House chain was started by the Coffee Cess Committee in 1936, when the first outlet was opened in Bombay. In the course of the 1940s there were nearly 50 Coffee Houses all over British India. It was during the late 1890s that the idea was formed.Due to a change in the policy in the mid 1950s, the Board decided to close down the Coffee Houses. Encouraged by the communist leader A. K. Gopalan(AKG), the workers of the Coffee Board began a movement and compelled the Coffee Board to agree to handover the outlets to the workers who then formed Indian Coffee Workers' Co-operatives and renamed the network as Indian Coffee House. A co-operative began in Bangalore on 19 August 1957, and one was established in Delhi on 27 December 1957. Later Bellary...", 4.0], ["Ambience", 3.5], ["3/5Food", 4.5], ["3.5/5Service", 3.5], ["3.5/5", 4.0], ["I visited this vintage outlet along with my friend upon his suggestion.When I first saw this outlet, I thought why did this guy suggest me this kind of place to eat.But I changed my opinion after tasting its food.it has a very old and standard furniture along with the same very old and standard taste in food.", 3.0], ["Been going here for many years for my morning scrambled eggs. It's ditto every time. :-) I wonder how. But upkeep of the place is not good. Kitchen doesn't look very healthy either from inside. Time to repaint the place, boys.", 4.0], ["After days of pining for this particular vintage establishment, happy to have finally set foot in it today. And the coffee didn't disappoint. Smelled like heaven, tasted like sunshine, and after-tasted like a good memory. Breakfast of scrambled eggs, omelette and masala dosa was on point. The prices low. The servers were all seniors, who served with s smile on their face. The food was on the table in 5 mins. What's not to love!", 4.0], ["The place doesn't seem the same anymore, though the ambience, furniture remains the same. The service was quick. The price is reasonable. However the taste has come down!", 3.0], ["This is the first time I visited this place after they shifted from MG Road. The place is a bit run down and they still have the same old furniture. It was empty and we had just coffee. The coffee was a tad sweet. I used to love their cutlets and omelettes.", 3.5], ["The location is perfect and its extremely pocket friendly.However, I did not like the coffee there, I prefer the lemon juice instead.The scrambled egg toast is really good, I like the omelet too.", 4.0], ["The government set up is not government like in attitude.The white clothed waiters had been happy to serve and delighted us with their smile.filter coffee, veg cutlets and a nice omelette will keep you in high spirits.", 3.0], ["I was told this is a really old place. Looks so too, like the good old South Indian hotels. Authentic is the word! The place is really small and cozy with hustling old waiters dressed in white and red uniforms. One shouldn't look out for ambience. But, Great coffee, no doubt. I like the cutlets here. Good omelettes  too.", 3.0], ["Indian coffee house is one of the legendary restaurants. The place has retained the old charm.We had masala dosa and a filter coffee. Masala dosa was loaded with butter and tasted average. Chutney and sambar was below average. Their popular Filter coffee was good.Staff are friendly and prices are moderate. Place is packed on weekends. So, you will have a wait for a while.", 3.5], ["After a long time of seeing this place on zomato and hearing a thing or 2 from others, we decided to visit this place on a Sunday morning. Went there a little late and were seated within 5 minutes. Ordered for a double egg omelette, upma, vada since Idly was over, cutlet, and bread toast. Must say that all was very very average and good quality and taste was found missing. Sambhar was like water and vada oily and cold. Upma was a savior though a little spicy. The cold coffee in the end was too good, very student type and was the best we had for the day's breakfast.", 4.0], ["The first time I went to the Bangalore coffee house it was on MG Road at the best possible location. Now it's moved to church Street. These places are rich in history and the waiters don't care much about service. They are just fast and bad tempered.Try the scrambled egg and coffee if you are visiting.", 3.5], ["Went to this place few weeks back when I was visiting bangalore.This place is very old school and takes you back to olden times. The bonus is, that it's very affordable to your pocket.Love the way the servers are dressed.", 3.5], ["This place needs no introduction to old Bangaloreans ..it's everything like old bengaluru ..laid back , easy going ,simple and quick service ...tomato and cucumber sandwich and poached eggs with toast are my fav ...yeps finish it off with steaming cup of coffee :) This place always brings a smile ...", 3.0], ["Vintage Bengaluru, finally!  For the first time ever for me.. I know it's bad on me.. But better late than never huh... All nice nice from the time I stepped in... First deadly pointer : the time travelled servers and their mighty uniforms! They look Damn good and my server was polite too!", 3.0], ["It's your chai/kappi-thindi place. Simple cafe but has this old rustic charm to it. They have a one page menu and I had my usual favourite Cold Kappi and Eggs. This was a breakfast right after attending Sunday Church. Sometimes it's good to come to places like this, it reminds you to appreciate the simple things in life.", 2.5], ["Another place in Bangalore where you shouldn't go purely for the food. Go there to experience the Bangalore of yore.We normally have their omelettes, toasts, mutton cutlets, and coffee.", 1.0], ["Waiters with a colonial clothing and old school ambiance , a combination of these two adds up to Indian Coffee House. The patrons of this restaurant are are often old Bangaloreans who come by to get a feel of good old times. The food was average. The waiters, most of whom should have retired a decade ago are often forgetful and lack etiquette. The place is very warm and i'm sure it would get uncomfortable if its summer. Its a dying restaurant which needs resurrection. Worth trying if you are around MG Road. After all restaurants like these may not be for long. Must try : Mutton Cutlet ,Sandwiches and Coffeee!!!Value For Money : 3/5, Ambiance: 2.5/5, Service: 2.5/5, Taste 3/5.", 4.5], ["But for the feeling of sitting in a restaurant which has been running for decades there isn't much to the place. Food doesn't taste great. Service is quick but untidy. There are elements of once present but now lost sophistication. Don't try the sandwiches. Cutlet n dosas tasted fine. Do have the coffee here.", 3.5], ["We decided to visit this place for lunch and we regret our decision. The ambiance was bad and their menu was limited. We ordered Masala Dosa and Meal. The dosa filling was cold and tasteless. The meal was cold and Sambhar/Rasam was plain, no taste at all. Finally we ordered coffee and found it was not worth the price. The hand wash area was dirty. This place spoilt our mood and hence have decided never to visit this place again. Avoid at all cost.", 4.5], ["The place needs no introduction. It's a different experience all together. We tried most of the items. Mutton cutlet is must have. Coffee is good. Eggs items are good with scrambled eggs and fried eggs being the best. Don't forget to tip the waiter, you will genuinely feel happy.", 3.0], ["If you want to travel back to 80's, this should be on your list.Except their location, nothing has changed here (neither furniture not the waiters :-) )", 3.0], ["Whoa, nothing beats this place. Ordered a masala dosa, an omelette of two eggs and a cold coffee. Served in a jiffy, and finished in no time! If you're in the area, definitely pay a visit at this wonderful place.", 4.0]], "58646": [["A very small place serving amazing South Indian food. Though the menu is very simple, the taste is good and the price is totally worth it. My favorite is idli, vada and the hot refreshing filter coffee. However they serve only chatni and no sambhar.", 4.0], ["Very good taste and quality... Must visit... One of the oldest outlets just like the veena at malleshwaram... Must try all in the menu... Always crowded...", 4.0], ["Sri Laxmi Venkateswara coffee bar! Located in BSK 2nd Stage, Opp to park. This is really a quick bite restaurant 🍽 nearby. A very small outlet, where it's very old and they have cash counter, when u enter to your left side of the outlet. They have a token system for each item, where we need to go give the token to the person to give our order. The service was quick as it was crowd enough at the morning. Orderd idly and wada, just wanted to try these two. Idly was hot and vada was crispy enough to make us feel good. Chutney was not up to the mark, where chutney is the main source for these idly and wada. Planned to head soon, to taste other food item.", 4.0], ["One of the oldest and yet coolest places at banashankari. This place hasn't changed with the years that I have grown up and yet it a beautiful place and the best place for a plate of idli and vada along with the famous ,mouth watering chutney!An old concept which is now copied by a lot of other new places that has opened up recently like by 2 coffee etc.So ,brahmins is by far the best but slv is not far behind. This is one of those places that has stayed for long and has lived to make the localities happy and doesn't care if it's not in one of those top must", 4.5], ["have places in bangalore.They are the best with idli and vada but also serve mouth watering khara bath and dosas.This place has just managed to carve out a place for itself in my heart .Overall,Ambience -4.5(stand n eat outside )Staff", 4.0], ["self serviceQuantity -4.5", 4.5], ["A bit overcrowded for obvious reasons this place is pretty old and serves authentic south indian food. Dowside: No place to sit and bit overcrowded as mentioned earlier.", 5.0], ["I love to visit this coffee bar any no. of times for Idly and coffee...and always i find it's crowed.We have to lineup for tokens and then to collect your order. It's a self service hotel.They serve idli with chutney and is delicious. Idli is so soft and melts while eating. And tempts for one more idli.And after hot idli, its must to try filter coffee, which they are famous.", 5.0], ["I wonder how I missed reviewing this place. This is my childhood favorite.They have remained the same till date. The idili just melts in your mouth. They have a limited menu. Try the awlaki bhath, you will fall in love. This place is highly recommended", 3.5], ["Best place ! No doubt! Just go on a weekday to enjoy their yum masala dosa becoz on Sundays they won't prepare dosa as the place shall be heavily crowded for breakfast! Must try is idli chutney, it's their signature dish and you'll be able to witness the sight of almost all the people carrying an idli plate along with other dishes😁  do try! Go on weekday go enjoy masala dosa! Don't expect ambience and all just go n hurriedly eat n come back! Price is quite economical for their quality!", 4.5], ["One of the best south Indian restaurant in the neighborhood. Known for its south Indian breakfast items like idli and dosas. Very good taste. Hygine. Nothing great about ambiance. Simple place.", 3.5], ["Nothing flashy in this place and this eatery is all about simple yet amazing food. Perhaps the best place to have breakfast in bsk 2nd stage.  Best Idli-Vada", 3.5], ["Best upma i had with amazing chutney. Right infront of a big park but parking is huge issue. Their coffee is good. Dosa not so great. The park infron of it is very beautifully done", 4.5], ["A coffee shop right in front of bsk bda park.Masala dosa was not up to mark.But the chutney was great blend of taste.Coffee was served hot but not something great to point. Idily and kesari bath a must try.Price wise its costly compared to other such type of coffee shopes.", 4.0], ["This one of the oldest eatery in South Bengaluru. The menu is like this -IdliVada Masala dosaKhara bathKesari bathRava idli And the most important COFFEE!!", 4.5], ["Do not miss this place! Great food for a good price and it tastes amazing. They give only chutney and no sambar, but somehow it tastes great in spite of that and you don't really feel the lack of sambar much. Expect the place to be crowded in the mornings, especially considering its small size, but that does ensure freshness of the food. A great place for breakfast if you don't mind standing and eating.", 4.5], ["Best breakfast joint at Banashankari. Breakfast hangout for all Banashankari crowd. Idly, vada, kharabhaat with chetni is epic. Must visit place Sunday morning.", 4.0], ["Awesome IDLI n VADA of the town. This is an ever crowded place. Have been visiting this place since more than 4 years. Try Idli with butter as an add on. It gives heavenly taste.", 4.0], ["Eat out !!Wen food is heavenly taste .. Who cares about ambience ..Their VADA and chutney combination is awesome.. Even kharabath is equally awesome..Wen ever i travel by mysore road .. My 1st pit stop is SLV !! Heavenly food 😍.  👍🏽👍🏽👍🏽👍🏽👍🏽", 4.5], ["Crispiest vada in town! Chutney is heaven with idly uppittu. Coffee is good too. It's a very old food joint very famous for south Indian breakfast. Food is good, they need to maintain cleanliness.", 5.0], ["It is very gud to eat... and u can enjoy the food to the core... dosa is the best... it can be affordable by every class of people... I enjoyed it very much...", 5.0], ["This restaurant is beyond rating :)Worked / Partied all night? hungry kya?? SLV hein na...Whenever i am awake till 4 am, working or otherwise, i deliberately push myself till 6 am just to treat myself at SLV. Its a feast for taste buds and worth the wait.Idli and chutney here is dope! and trust me one would never have had a idli chutney like this anywhere in Bangalore, wait... anywhere in India I guess! Masala dosa is another killer. I am a die-hard fan of Khara Bath. No one makes an Upma like that.. not even my mother ;)Coffee-Tea is good too and so are all the items mentioned in the menu. I wish the place would have been a bit spacious coz it gets over crowded too easily. I guess few places are iconic and they need to stay that way! Nothing has changed in SLV since 30 years !The restaurant is open from 6 AM to 8 PM all days except for Sundays it is open till 12 PM.", 4.0], ["SLV, opposite to the BDA park in Banashankari, serves the best idlies and crispiest vadas. I have been visiting this place for almost a decade. The taste is so consistent every time I go back. The kharabath is great as well. The place is pretty small, but the service is super fast. There isn't any place to sit, except for the steps of nearby shops and the park's steps, if you are willing to cross the road. It's a great breakfast place and the humble idly vada chutney from this place will definitely impress everyone", 4.0], ["Masala dosa tastes good than every other food here. Kesari bath is also good. Place is small and crowded most of the time. Though the food tastes good, i feel few foods are over priced...", 4.0], ["One word to describe it's unique recipe on Idli-Vada-Chutney", 4.5], ["'Simply Superb'. I found myself lucky to grab a plate whenever I pass on this restaurant. Pocket Friendly and Unlimited Chutney makes you feel food craving for this dish which they offer. Other dishes are good too.. Do try once and never miss an opportunity to visit this restaurant.", 4.5], ["Nice place. Nice food. You get to eat some typical south indian food here. Masala Dosa and Vada are mouth watering. Do give a visit to this place if at all you happen to be somewhere nearby there.", 4.5], ["Been going here since the time I was a kid. It is a small outlet with no seating area and it is forever crowded and the crowd just keeps increasing. In spite of the crowd, the service is really fast and you'll have your food fresh and hot in your hand in under 3 mins. Though it seems like a place where hygiene would be of concern, they do maintain good hygiene.They are well known for south Indian breakfast items like dosa, idli and vada, khara baath and the like. Being a south Indian myself, I absolutely love everything they have. The chutney they make is stupendous! The filter coffee is just on point and gives you that boost you need for the day! The prices of course are very cheap.A plate of masala dosa and vada in one hand accompanied by filter coffee in the other seated on the footpath with a couple of friends is a perfect formula for a lazy Sunday breakfast!", 4.5], ["Being a fan of south Indian breakfast its hard for me not to like a legendary place like SLV which produces one of the best idli and dosa and the mouth watering chutney ......just amazing .......i remember this restaurant from when I was a kid......when ever I go to the devagiri temple I visit this place .....my grandpa  always celebrates his birthday here with his temple gang :P ...try the idli first! And then the dosa...prices are low and pocket friendly .....if ur a south Indian food lover this place is a must visit..........only complain its always crowded ! Other than that one the best darshini in Bangalore !", 5.0], ["Limited menu. What IS available though, is outstanding. the chutney is lip smacking (no sambar", 4.5]], "18278230": [["Average.!! Could do a lot better. Might get really loud during the weekend. Choice of items in the menu is good but they really have to work on the taste.", 1.5], ["Quite innovate cuisine and presentation also ... we had many starters and even the drinks were served differently... this restaurant has done an excellent job in presenting and even the taste was up to mark... as they say we first eat with our eyes..!!!Even the ambience of the restaurant serene... overall my rating is... but I feel it is a tad bit pricey...Food", 4.0], ["4Value for money", 3.5], ["3.5Service", 3.5], ["4Ambience", 3.0], ["4", 2.5], ["The ambience and the way the serve ,the utensil they use were really good .The ambience and the outside part of the hotel will definitely pull u in . We tried the tamatar vadi ka shorba the flavours that has been added to it made the shorba a really good one .For the staters we had lucknowi dahi ki shammi and challi komi kebab , the lucknowi dahi ki shammi was really good it had a very gud flavour of ginger mixed in yoghurt . Being a vegetarian we did not find the challi komi kebab appetizing it looked like a chicken lollipop and we were not able to get any flavours .Shahi subz daalcha was really good and kathiawari tarkari wasnt really great we paired it with butter rotis . And finally we had ghee rice with kachumber (raita) it was good .Ambience :4.5/5Service :4.5/5Food :3.5/5", 2.5], ["A drive through a busy narrow lane finally led me to this mughlai place.. the restaurant was roomy as well as airy with well done interiors! It was surprisingly empty for a Saturday evening though.. The neat and tidily maintained restaurant was quite prompt when it came to service. Their signature starter tasted pretty good whereas the main course, which arrived in no time was rich and wholesome! The captain, Deepchand, kept enquiring if I was satisfied with the food, which was appreciable, as did the steward Brijay, who was really courteous.. A unique styled menu with authentic mughlai names and importantly good grub that seemed a welcome change amongst the numerous restaurants that have recently come up without much quality or service...One noticeable thing was the presentation of their dishes..innovative!", 5.0], ["Starting with the ambience which is top notch! We got enough privacy for a good cousins only dinner Have to really appreciate the way they serve lassi which is really wonderful but the only problem with that is I find the quantity quite less I would grade my experience on the staff for a 6 on ten Otherwise this is a place that is worth checking out The food takes some time to arrive", 1.5], ["The search for good north indian food in Bangalore continues... Ab Kopper Kadai ka number aayaShowed up on a wednesday evening with table booked. With all the copper/metal on show , the restaurant's name was too much in the face :) The steward was courteous and more than willing to help Now the all important Food Starter", 1.5], ["Lucknowi dahi ki shammi . Good looks and lot of promise but was a complete dud. Gravy", 3.0], ["Verkha singh’s makkhan paneer . The Paneer was under cooked and we had to return it to the kitchen for repair/rework. On the second attempt the cook still did not get it right. We later learnt that the main chef is on vacation and his deputy is trying his hand at the stove. Some brownie points for the folks to try to fix it and admit that they have a short coming on their side. The steward saw that we were unhappy and promised us that the next time we visit them they will take better care of us . I told them that I may not return :( Naan", 4.0], ["Buttery expensive white bread . Was good", 2.0], ["The search for good north indian food in Bangalore continues... Ab Kopper Kadai ka number aayaShowed up on a wednesday evening with table booked. With all the copper/metal on show , the restaurant's name was too much in the face :) The steward was courteous and more than willing to help Now the all important Food Starter", 1.5], ["Lucknowi dahi ki shammi . Good looks and lot of promise but was a complete dud. Gravy", 4.5], ["Verkha singh’s makkhan paneer . The Paneer was under cooked and we had to return it to the kitchen for repair/rework. On the second attempt the cook still did not get it right. We later learnt that the main chef is on vacation and his deputy is trying his hand at the stove. Some brownie points for the folks to try to fix it and admit that they have a short coming on their side. The steward saw that we were unhappy and promised us that the next time we visit them they will take better care of us . I told them that I may not return :(...", 5.0], ["On request of there manager mr vivek we visited this place which is located on best possible point in koramangla.They are pinor on the way what they do with food and are best at what they do.I love the way there ambience is done you need to experience yourself rather than going through the review.Service is such a great experience and a treat to everything.They way they serve food in those trucks and the lassi my favourite was kesari lassi.Food is just mind blowing and it allows you to be nostalgic in every bite.Everything has a story to tell.", 3.5], ["Being new to bangalore and to zomato i really wanted to try some good north indian food.but sorry to say was dissapointed in it @ kopper kadai.Good thing was the presentation of food,ambience and service.Bad thing was such a lound noise of customer,flavours of food mostly bland,Major concentration is given on presentation and quantity of food rather than quality of food.Soup dal e danhiya it cant be considered soup its more like a dal preparation (average).", 4.0], ["Being new to bangalore and to zomato i really wanted to try some good north indian food.but sorry to say was dissapointed in it @ kopper kadai.Good thing was the presentation of food,ambience and service.Bad thing was such a lound noise of customer,flavours of food mostly bland,Major concentration is given on presentation and quantity of food rather than quality of food.Soup dal e danhiya it cant be considered soup its more like a dal preparation (average).", 1.0], ["I would rate this restaurant 3/5 stars .service was very bad they took almost 20 mins to just serve starters and again another 15 mins for the mains . When it comes to the food , it was average . Had ordered butter chicken which was too sweet for my taste , the chicken Malai Kabab was hard . Disappointed.", 1.0], ["I loved the ambiance more than anything else, but it'd be unfair if I didn't mention the variety of food they had to offer. To start with the sugarcane chicken was something I never had tasted before and something you'd end up loving too. The staff is very supportive and quick on toes. Would love to go there again . The presentation is something worth noticing.", 3.0], ["Went to this place for a team outing place after trusting the review on zomato, but the overall experience was not at all good. Firstly they hardly had any options in starters, main course or deserts and also the taste of most of the items was not good.", 4.5], ["Service at the restaurant was very slow.. food was also not that great.. Very less vegetarian options..  serving style is little fascinating", 3.0]], "58786": [["It is a Rajasthani cuisine restaurant in JP Nagar Bangalore and I recently got to visit it with my cousins. We usually eat few of the Marwari Meals in the restaurants but in here the varieties were endless. Like the dal bati cooked in ghee was really something and the Jalebi Rasmalai too. You won’t be able to cover the menu in 2-3 visits as well and visiting again, it is quite an extensive thali.", 5.0], ["A place to relish authentic rajathani cuisine. Ambience", 5.0], ["royal, lots of traditional architecture giving a Rajasthan feeling. Perfect blending with meals. Service", 2.5], ["servers are prompt, makes your meal pleasurable. Food", 4.0], ["We have been twice to this place", 4.5], ["would love to keep coming back. We have tried couple of dishes and each one with perfect spice levels and yet authentic.", 4.0], ["We went here on a Sunday for family lunch. Indeed, the ambience was really authentic just like what we saw photos of, but when it came down to the food and service, it wasn't up to the mark. Having Rajasthani roots, the food was rather disappointing with the jalebi and rabri being the saving grace. A one time visit.", 4.0], ["Ambiance is super cool. Food was bit ok, it was just that we could not try much. I would rate this place about 4 for the food. People are really assistive and explain well about the items they serve.", 3.5], ["Excellent ambience all around, authentic Rajasthani style tasty dishes on a silver platter, not too crowded on a weekday for lunch, overall very good.", 3.0], ["Liked this place for an excellent spread of varieties. Be it with sweet, spicy or tangy, they have all flavors, unlike other Rajasthani outlets. Almost everything was tasty and satisfied the taste buds and stomach.", 5.0], ["We went here for our family gathering...  Amazing spread of both appetizers and main course...  We were delighted to have it in silver plated! Very well maintained, tasty and variety food.. All my family members loved it..  It was fun!!", 5.0], ["The ambience is the most appealing . They have a decor of old classical times and the service is great because of the friendly staff . Being a south Indian , I don't quite know all the dishes so they explain to you about each one of them and it's how it's made . The food is quite filling actually. It's better if you are REALLY hungry to enjoy all the dishes available on the buffet . Taste was pretty good.", 1.0], ["The taste of food is very average...the ambience is just OK....except for the fact that they serve in silver plates and bowl.....the menu there is very monotonous as compared with Rajdhani food....", 5.0], ["Celebrated my cousin’s reunion last week. We all being marwaris enjoyed the delicacies with utmost pleasure. Being away from home it was true taste of Rajasthan in heart of Bangalore. A nice getaway memory with my cousins.", 5.0], ["Had a meal like a king and was served like one. Enjoyed all dishes thor-oughly. From starters to desserts, it’s a yummylicious experience. Being a pure vegetarian it was a delight.", 5.0], ["Really bad experience, a fellow customer found a cockroach in the Dal Bhati. Left the place immediately! Be aware! What a shame. The ambience was good and we were on starters which were also good.", 1.0], ["Kesariya is nice traditional restaurant where food is served in a huge thali. The meal starts with a huge variety of snacks and welcome drink followed by main course and dessert. Ideal place to visit with friends and family.", 3.0], ["A vegetarian’s paradise. The chaat festival is too good to be missed. Loved the doll display, had read about it but never got a chance to see it. A pleasurable visit. Looking forward to my next visit.", 4.0], ["Such an amazing soothing place , I never thought kesariya had such a beautiful peaceful restaurant, very nice n clam ambiance they have. For the first time I had my dinner with rajasthani song in the background never thought it would be so good.They have good variety in thali with chat live counter . Starting from welcome drinks to deserts , I felt almost everything's tasted very good real rajasthani authentic food. Service is at its best. Definitely recommend this place and would considers visiting this place again.", 1.0], ["We expected a lot from Kesariya restaurant, they had a great ambience, but the food was no where close to being good.Starters were too many, but served in very small quantities. Main course was hardly noticeable.It was one-off a bad experience.", 4.5], ["It was OK...... Not worth the money at all...... Would not visit again or recommend to anyone....... Service was not that great.............", 4.0], ["'Kesariya balam aao ni, padharo mhare des'. This runs through your head when you enter the ambiance. Since reserved early on Zomato, we didn't had to wait much.Being on occasion of Dusshera it was jam packed. The mild Kesar aroma fills you into a soothe.The chats being served as starters were good. It included Papdi chaat, Katori chaat and many more.Food served was quite hot and fresh. No negatives on it. The only drawback today was the Service. Being a full house on festival day might be taken into consideration.", 5.0], ["Horrible experience! Came here with family only to be served for over 3 hours. We actually had to walk into the kitchen and ask for food. Terrible experience. I recommend you never come here.", 4.5], ["Loved the entire experience. Good food, well mannered and informed staff, a pleasant ambience has me recommending this place to everyone who I know loves good, authentic food. :D", 3.5], ["Absolutely wonderful experience.The food is great. They don't run through the serving.Ample time to enjoy all the available varieties.Ambience is great as well.", 4.5], ["As soon as you enter the first thing you feel good is the ambience which has subtle royal touch. The staff are very cooperating. The silver thalis adds to the ambience.Its mainly Rajastani cuisine. Each dish name is told by the staff. At least there are more than 30 variety.I specially liked salad chats green chutney baby corn pakoda black channa curry imli juice sweets n dum biryani . The food is really filling n you will definitely find yourself loaded.Apart from food nice place to sit n spend time with your family or friends. The staff are extremely cooperating n helpful.", 3.5], ["My family was looking for a nice, quiet Vegetarian place for dinner, and we came across Kesariya in zomato. Kesariya is located in JP Nagar, in the same building as Bresky Pub. This place has the sweeeetest interiors, very nice ambience and the staff was so friendly too. As soon as we entered and got seated, they advised us to try out the chaat section. The aloo tikki chaat and Papdi chaat were absolutely delicious. One of the best chaats I've ever had. After that, for starters, We had bhajji with various chutneys, and some salad. For main course, They served us the proper Rajasthani cuisine with my favoriteee Dal bhati churma! And they ended it with some yummy Kulfi. Taste was impeccable, service was amazing and I loved everything about this place. What's more, they serve their food in silver plates ! 👑", 4.5], ["Nice place, Nice interior  😍 nice presentation . But the food is not worth the money (500) .Food taste was not as expected ,Was disappointing a little. Me and my friends had been there to enjoy the rajasthani  food , it was good but not the best . U can try it once but it's expensive .", 4.5], ["The food was amazing, but a bit of salt and sugar variations, I and my sister like the food and especially some items we became total fida. Ambience was great and so were the staff's hospitality.All in all great experience.", 4.5], ["Had a lot of expectations from this place. The decor is lavish and a little overwhelming. We therefore chose to sit on the terrace which was a little more casual. Service was good..the waiters are trained to over-serve you and push you to eat more. Food-wise..it was an average meal. The dishes ticked all the boxes but flavour was missing. Nothing really stood out. Won't be back here.", 4.5]], "58698": [["Always had a great experience here. The starters are really good. The main course disappointed us this time but I'd love to believe it was an exception. The staff here is extremely well trained and a good benchmark for other players.", 3.5], ["We decided to pay this outlet a visit on a Sunday afternoon after having heard about its fame in Delhi NCR. This place serves South East Asian food, which is one of my personal favorites. We ordered Crispy batter fried Calamari in starters. In main course we ordered Osaka Tube Station Chicken Bowl", 4.0], ["it's wholesome and can be easily shared by 2 people. Very flavorful broth.We also ordered Laksa Prawn soup which was one of my favorites. The body of the soup was coconut milk, lemongrass and ginger. This dish can also be easily shared by 2 people. The portion size is very good and certainly worth the money.We ended our meal with delectable handmade coconut and palm sugar icecream. It was out of the world and left us craving for more. The fact that it was hand made was clearly evident from its rich texture and choice of high quality ingredients.My final ratings would be:Ambience: 4/5Menu selection: 4/5Food quality and taste: 4/5Service was efficient and hence rated 4/5.", 4.0], ["We decided to pay this outlet a visit on a Sunday afternoon after having heard about its fame in Delhi NCR. This place serves South East Asian food, which is one of my personal favorites. We ordered Crispy batter fried Calamari in starters. In main course we ordered Osaka Tube Station Chicken Bowl", 5.0], ["it's wholesome and can be easily shared by 2 people. Very flavorful broth.We also ordered Laksa Prawn soup which was one of my favorites. The body of the soup was coconut milk, lemongrass and ginger. This dish can also be easily shared by 2 people. The portion size is very good and certainly worth the money.We ended our meal with delectable handmade coconut and palm sugar icecream. It was out of the world and left us craving for more. The fact that it was hand made was clearly evident from its rich texture and choice of high quality ingredients.My final ratings would be:Ambience: 4/5Menu selection: 4/5Food quality and taste: 4/5Service was efficient and hence rated 4/5.", 4.0], ["I have been to this outlet couple of times. I simply love their Pan Fried Noodles. Its amazing. The interior is good and the location is quite happening surrounded by couple of other eateries. A must visit", 3.0], ["Food and liquor options are excellent...So are the staff and the ambience too.. fabulous..Very prompt and helpful service..Only drawback i felt is the quantity per price...can do better!", 4.5], ["The food was good, but I think the place could be a little more lively. Music wasn't great either, the servers could be more welcoming in my opinion.", 4.0], ["Highly recommended.This place has never let me down when it comes to their variety of soups. Have been there twice and plan to go there again some day soon.Trust me for this place you can chose anything blindly or maybe ask the waiter and let mamagoto play its magic.", 3.5], ["Overall good experience. The ambiance isn't that great. The interior is attractive but the sitting arrangements is not up to the mark. Coming to the food, we ordered hakka noodles which was good. Chicken dumplings were nice. The coconut and palm sugar ice cream is far better than other ice creams. First time, I ate this item. Courteous staff.  I recommend this place to everyone.", 4.0], ["Hustling with patrons and activity always this is a good place to head for... Head out when you have a agenda with your friends. Pre booking a table is not always a possibility since the place is always overflowing.Good food! Great service", 4.5], ["One of my favorite places in Indiranagar. Although this is slightly on the higher side, I feel the quality of the food never lets me down. It is quite authentic and considering that it's a chain of restaurants now they have managed to maintain the quality really well. Ambience is top class. I give it a 4 and not a 5 because, sometimes I feel the menu gets a bit repetitive. All in all a nice place to go out with friends and family.", 4.0], ["Best asian restaurant till date..i was very lucky to have made reservation and there was like quite occupied place and long que.Food i could rate it 4.5/5Ambience:4.5/5Service too is 4.5/5", 4.5], ["This review is for only food as we ordered food from here for dinner through Zomato while celebrating an achievement in one of my friends house. I have heard about it from so many friends and they didn't let me down.This is most definitely among the top Oriental food destination in Bangalore. For delivery, the packaging of food was really peppy and attractive, makes you feel good about eating.Food is great, we ordered crispy lamb and Prawn dumplings as starters, all of them delicious. The pork belly dish and noodles were also lip smacking. The quality of fish was really good(as a Bengali I'm certifying 😂).The price is a little higher but it's worth every penny you pay. Overall I loved the experience.", 4.5], ["Perfect place for asian and oriental cuisine. I just loved this place. I was here with my friend for dinner when i entered this place it looked like some warehouse with some Chinese posters pasted on wall which gives you the feel that you having food on asian streets. Here you can taste the actual asian food. Its not everyone's cup of tea but if you admire the asian cuisine taste this is the place you need to try. Its little costly than you usual places but what the heck it can be ignored for yummy food.We orderedStarters : Veg Spring roles , Honey chicken , Cheese and truffle oil dumplings and Crystal dumplingsMain courses : Veg pan fried noodlesDeserts : Caramel Toffee cake with venila ice cream (must try)The food was amazing. Honey chicken was yumm.. the chicken was very tender. The honey and soya sauce was well made, I was able to taste sweety and spiciness together. Perfect blend i must say.Must try crystal dumplings. Even though we didnt order it, the waiter severed it to us by mistake and later they didnt even bill it.", 4.0], ["Perfect place for asian and oriental cuisine. I just loved this place. I was here with my friend for dinner when i entered this place it looked like some warehouse with some Chinese posters pasted on wall which gives you the feel that you having food on asian streets. Here you can taste the actual asian food. Its not everyone's cup of tea but if you admire the asian cuisine taste this is the place you need to try. Its little costly than you usual places but what the heck it can be ignored for yummy food.We orderedStarters : Veg Spring roles , Honey chicken , Cheese and truffle oil dumplings and Crystal dumplingsMain courses : Veg pan fried noodlesDeserts : Caramel Toffee cake with venila ice cream (must try)The food was amazing. Honey chicken was yumm.. the chicken was very tender. The honey and soya sauce was well made, I was able to taste sweety and spiciness together. Perfect blend i must say.Must try crystal dumplings. Even though we didnt order it, the...", 5.0], ["I was quite excited to visit this place as it had lots of amazing reviews but I felt the experience to be sub-par. The staff were very amicable and efficient but the food didn't pack the said flavour bomb it claims to have. Everything seemed quite ordinary.Pros : 1. The ramen bowls and rice bowls are worth the money you pay. Good hearty portions. Serves 2 people comfortably2. Good ambience and musicCons:1. Expensive considering some items are very small in portion2. Lacks the expected flavor bomb", 4.0], ["I stepped in to Mamagoto for a casual lunch. I had not planned it and just came out of office and while searching for a place to have lunch, I walked in to this place. The place has a strange decor and it looks like a warehouse. The place was empty when I stepped in and the waiters greeted us warmly.The food was great and some of the best oriental I have had. I used to go to Mainland china often but this may be my new choice. The prices are on the higher side but more or less comparable to mainland china.I will visit this place once more to try out some more stuff and update this review.", 5.0], ["Situated in the heart of Indiranagar, this place isn't so difficult to spot. It's absolutely Asian and the food tastes lovely. The presentation, ambience and service all score a 4.5. For the price it could be rated low as its on the expensive side. Really, the competition is so high that one would lookout for a place where there would be value for their money and there are plenty at the moment that offers you that. However, overall, if it's the food that really matters, this place should be on your top choice list.", 5.0], ["One of the best Asian food places we have visited in recent times. Flavors are different than usual Chinese or Thai place. Crispy Lotus Stem is must have and also their rice bowls.", 4.5], ["This place never disappoints me. Its one of the few places that rate high in my list of places that I can always fall back on of I want to ensure I experiement a new dish and not be disappointed at the same time. Recommend their Thai food... Yummmmy! And the funky ambience adds to the experience!", 4.0], ["Ordered Corn pepper salt when i was sitting idle nd nothing to do at my hotel room.. And their corns were so tasty although I couldnt what was spinach for with that much quantity (though I mixed it with the corns).", 4.5], ["We tried Prawns Crackers, Chicken Satay and Chicken basil cups for starters.And Spicy chicken Ramen Bowl for mains. Starters were good but Ramen Bowl was lip smacking.Overall a Good start to the weekend.", 4.5], ["Awesome food guys. Haven't eaten such good food in a long time! Definitely visiting this place again! Loved the drinks and Main course. :) #mustgo", 3.5], ["Out of the many places that serve or claim to serve Thai food in the city, Mamagoto is definitely my go to place. I find that their flavours are closer to being authentic than any other place. The soggy basil fried rice is delicious. So is the fiery shrimp friedrice. The Thai fried egg that comes with adds to the authenticity. The curries are great too! Their home delivery is also prompt and packed really well. The only reason I do not give it a 5 is because I like my Thai food to be really hot and their fried rice didn't quite get to that level, but that's a small matter. Definitely try the place!", 4.5], ["Decent food with interesting ambience. Located in buzzing Indiranagar this place offers great variety of Chinese food. Service is really good.", 4.5], ["My favorite place!! My cousin introduced me to this place and ever since I have fallen in love with it!Recommended : Prawn Crackers Usually I have their Apple Cinnamon Sangria. Which is just so yummm with their Pan Asian Food. Alongside you can go for their Prawn Crackers , Pad Thai and a Shrimp dish that I'm unable to recollect the name. If you are a dim sum fan, you should go for that too! They have a variety of it! It is a dim lit place with amazing interiors and very sweet people to greet you. Great service and great food!", 4.5], ["Ambience: 4/5Staff: 5/5Service Speed: 5/5FoodStreet Chicken Satay: 4.5/5", 4.5], ["The chicken was tender and juicy and the sauce was absolutely perfect for the skewers and was delicious.Smoky BBQ Pork Belly Bowl: 4.5/5", 2.0], ["I would highly recommend this for people who are looking for places where they do justice with pork. The sticky rice was so rich in flavour. For a second, I forgot about the pork. The BBQ dip went really well with the pork too.", 4.5], ["Ambience: 4/5Staff: 5/5Service Speed: 5/5FoodStreet Chicken Satay: 4.5/5", 4.5], ["The chicken was tender and juicy and the sauce was absolutely perfect for the skewers and was delicious.Smoky BBQ Pork Belly Bowl: 4.5/5", 4.5], ["I would highly recommend this for people who are looking for places where they do justice with pork. The sticky rice was so rich in flavour. For a second, I forgot about the pork. The BBQ dip went really well with the pork too.", 4.5], ["Love be the food , the ambience and the cocktails. Cocktails look so pretty and taste as good. Go for bowl for 2 and they are really yummy and filling", 4.0]], "18375545": [["Surprised  being here.mind blowing masala dosa and the strong filter coffee  refreshed  me  and  it's located a peaceful  place. I strongly  recommend  All to visit  this tiny and sweet place...", 4.5], ["When you're looking to load up on some wholesome food, head here. Easy on the pocket and the softest damned idlis I've ever eaten! The chutney is flavourful, the dosas are crisp and the lemon chai is heaven sent for lactose sensitive people like me. What I really liked was my crisp masala dosa though... spicy and fresh and not at all oily. Packed a bunch of stuff for the other hungry souls who couldn't make it out for breakfast and they were equally happy with the portions and taste.Definitely going back!", 5.0], ["WIth the advent of cafe style places serving regular south indian breakfast or rather as we say tiffin options, the darshini style places have got a good competition in hand.This outlet is a fairly new entrant in the New Bel Road Area and is a very small place, similar to a shop with option of grabbing the food or coffee there and having it on the road side. Take away is a good option but the taste is always better when eaten right away rather than packing at home. Mine was the former though, had to grab breakfast for a few folks and opted for a takeaway.They have the regular idly, vada, dosa's on the menu. The ghee upma and the coffee here is apparently a stand out. They also had pongal which was not ready the morning I decided to head here. Packing was neat. The boxes too had the outlet name labeled.Chutney was packed in these nice small packs good enough for a plate of idly/vada.One drawback is that they do not have sambar similar to how quite a few places like Brahmin's thatte idly are known for.So, if you are one of those folks who doesnt like idly without the sambar, this is not the place for you or probably grab sambar from somewhere else !The idly's were good but could have been softer, the vegetable dosa was satisfactory. Vada and Ghee upma was the best of the lot. Upma was packed with flavors. Vada was nice and crispy.The place is titled as a coffee outlet which probably could throw off some people who do not know that they also have food available, I was one of them thinking that its just a coffee place until I referred the same in Zomato ! Service is quick.Nothing much on ambience and price is a bit high compared to other darshini's. Parking is a problem in this area but park far and walk as options are aplenty in this street.", 3.0], ["WIth the advent of cafe style places serving regular south indian breakfast or rather as we say tiffin options, the darshini style places have got a good competition in hand.This outlet is a fairly new entrant in the New Bel Road Area and is a very small place, similar to a shop with option of grabbing the food or coffee there and having it on the road side. Take away is a good option but the taste is always better when eaten right away rather than packing at home. Mine was the former though, had to grab breakfast for a few folks and opted for a takeaway.They have the regular idly, vada, dosa's on the menu. The ghee upma and the coffee here is apparently a stand out. They also had pongal which was not ready the morning I decided to head here. Packing was neat. The boxes too had the outlet name labeled.Chutney was packed in these nice small packs good enough for a plate of idly/vada.One drawback is that they do not have sambar similar to how quite a few places...", 3.0], ["Recently went to this new joint when we were on our way to Nandi Hills and were very glad we did. The idlis were soft, the vadas were crispy and the chutney was excellent. I also enjoyed the pickle dosa very much as it was something i had never tasted before. But the highlight of our morning was the Anjoor Halwa. Amazing and a must for any one going here! PS: The coffee very good too!", 4.5], ["Love this place. Quality over quantity is what they stand for with a simple menu that shows they know their forte and would like to stick to it. And that is why I don't have to think twice before I order anything on their menu. The coffee is just perfect and for all those who don't really like Upma", 4.5], ["their Ghee Upma might make you change ur mind. Don't miss the idly vada's either. That's as much as I could have. Try the rest for yourselves", 4.5], ["Went here with a few friends and ordered almost every dish on their menu. We were very happy with all the food, my personal favorites were the pickle dosa and the fig halwa. A must visit to try all their authentic dosas topped off with a generous amount of ghee. End your meal with a hot filter coffee and I'm sure you'd be as content as our hungry bunch was.", 4.0], ["A new aroma of coffee is served in chetty's Anjoor halwa is a must try in this outlet Crispy vada and pickle dosa wah !! Mouth watering ... it's a must visit place in sanjaynagar", 4.5], ["The restaurant serves authentic  idly, vada and chutney... feels awesome to have, simply set up no unnecessary hype.. the pricing is also decent, they serve really fast and the place looks very hygienic.. lite food and a good experience, I hope they start this concept in Jayanagar soon.", 5.0], ["The food is amazing its a quick bite place its a good authentic south Indian food and good place for a quick coffee. The best part is Anjoor Halwa is too yum.Its a replication of our house food.", 5.0], ["Finally a coffee place that serves Coffee the way it used to be in the old Bangalore days . Was passing through on one of the rare trips out of South Bangalore and came across this newly opened cafe .. loved it . Wish they would open a branch in Jayanagar too!", 4.5], ["I have already been to this place at least thrice and I love the whole experience of the chettys food. I would definitely recommend the vegetable dosa and the paddu and the coffee is the best in all of sanjaynagar that I can promise !!!", 5.0], ["Very different from the usual darshinis.. the pickle dosa,kesari bath and ghee Upma is a must try and the anjur Halwa is to die for. Must try if you are on BEL road !", 4.0], ["The restaurant is very clean and service is very nice.Got to try out different kinds of soda which is not available in regular darshini's. The pickle dosa is a must try.", 5.0], ["yummy vegetarian south indian food! vegetable dosa , paddu are a must try on the menu! a must visit in sanjaynagar if u want some great south indian food!", 4.5], ["Chutney tastes amazing. And coffee is just perfect. Must visit South Indian coffee bar in Sanjay Nagar. Matches the taste of Brahmins, SNR and SLV from South Bangalore!", 4.0], ["The place is really good and is my go to breakfast joint now, especially the Kesari bath is so yummy with the ghee used. And to top all that the coffee is the perfect mix", 4.5]], "61111": [["Milano stands out among all the other ice cream parlour in Bangalore. They have amazing ice cream, the only problem here is they don't have parking. We had 4 different flavours of ice cream which were all amazing in taste. We've also tried their Ice cream cake slice and this too is the best ever. This is my first visit to Milano and I'm definitely recommending this place to all the ice cream lovers and I'm definitely coming back for more.", 4.5], ["Perfect in all ways. This place is the shizzzzz ! I have such cravings for their flavours that I don't mind travelling close to 20 kms one way when my heart desires a little spirulina or their rum and apple sorbet. Both their gelatos and sorbets are top notch.  And the flavours !! Some of the best I have had in my life. Very different from standard flavours you get elsewhere. Some flavours will make you wonder how can those tastes even be combined together but these are geniuses at work, the same people who are involved in Fort Kochi. I havnt tried their crepes or sundaes but would like to do that soon.", 5.0], ["AmazingThe entire concept of giving 3 ice creams is superbIt's filling and you get all the flavours you like.Quite a good place situated in the heart of the city.Simple, tasty and unique flavours.The smoothness of the gelato is to die for !❤️", 4.5], ["Being a die hard icecream fan, went to milano to tick if off my list. Tried the Chocolate sundae. Top notch gelato ,like to think the best I have tasted in Bangalore. This place deserves a 5/5 . But out of the short menu, they did not have some items that I would have liked to try on my one visit. After all, travelling across the town is a lot of pain :) MUST Try for ice cream / dessert lovers. ** update ** Went a second time , and this time tried the Truffle Icecream. It was exceptional , quite deservedly modified my rating to 5. The quantity in this concoction was super filling and the gelato was exceptional. 2 flavours of ice cream with Cocoa dust on it ! wah wah !", 5.0], ["I have been here around 8+ times already. My go to place for ice cream. My favorite flavors are anything with berries, orange and Mascarpone cheese. The price is very decent for the portion. A 100 gm cup can be mixed with 2 flavors.", 4.5], ["Goodness me! I just tasted the best ice cream in town yesterday. I went here seeing the rating on zomato and i wasnt let down a bit. The ambiance is just what is required for an ice cream parlor. I had the two scoops in the beginning which urged me to have two more. Will try their Crepe, Sundaes and Lollypop next time. Pricing is worth the buck. Management and staff are excellentAmbiance: 5/5Food: 4.5/5Staff: 4.5/5Value for money: 4.5/5", 5.0], ["Having gelato for the first time.. This place is away from the major Indiranagar area.. Visited this place with bro and we took the sugar coated cones with 2 scoops.. my brother took the fruity flavors while I chose the chocolate flavors.. These were good and different from the ice creams elsewhere.. would definitely recommend this place 😊", 4.5], ["It was a great pleasure to get introduced to this place And there are hell lot of flavours here.  I was excited to see jasmine flavored ice-cream.  So decided to try it.  Well... it tastes exactly as the fragrance of the flower.lolWild berries was too sour and wasnt my type. Milk and hazelnut was amazing and so was truffles. Nice place for ice-cream lovers.", 5.0], ["Excellent place for ice cream,  Its so fresh and good.... it's beyond words. I definitely recommend this place to all ice cream lovers...  A must go place. I have tried almost all flavors here and  to tell the truth I have never been disappointed.  Everyday you can find some new flavors there....", 5.0], ["Voila! This is my last review during my last stay in Bangalore. And while writing this, my heart feels a bit heavy as I felt while bidding farewell to my partner in Bangalore. Hence, this review will always reserve a special place in my heart. As it was the last review, we both decided to celebrate with the family.I was wondering such high ratings would serve extremely high quality ice creams and was disappointed at no point.We had taken a sample platter consisiting of four scoops of different flavours of your choice, freshly whipped cream and hot chocolate sauce. We chose -Extra White (felt like eating a white chocolate ice cream.)Wildberries (rich with flavours of berries, this is more of a sorbet, very refreshing.)Tiramisu (had hints of coffee, which is more dominant in a tiramisu icecream, but what special is that you could also taste the mascarpone cream cheese, simply loved it!)Orange Cheesecake Gelato (a new kind of ice cream, very different flavour, all of us liked it.)Stomach was full but not to our heart's content. So, we took another two scoops in separate cups. They serve 100gms in one cup, you can also divide it into two flavours 50gms each. I think the amount is pretty amazing for a cup. As my mother insisted to take a cup of her favourite Extra White ice cream, we went for one cup of it and another cup of Chocolate Truffle. Both the flavours were insteresting and we loved them.The portions are commendable, pricing is perfect with no added taxes and the flavours seem great with the freshly churned rich cream. Sitting area and the decor consists of everything white, that would soothe your eyes definitely. This place is highly recommended for trying out the high quality ice creams and I can guarantee that you would have a lovely time with your loved ones. Happy Dining! :)", 4.5], ["Voila! This is my last review during my last stay in Bangalore. And while writing this, my heart feels a bit heavy as I felt while bidding farewell to my partner in Bangalore. Hence, this review will always reserve a special place in my heart. As it was the last review, we both decided to celebrate with the family.I was wondering such high ratings would serve extremely high quality ice creams and was disappointed at no point.We had taken a sample platter consisiting of four scoops of different flavours of your choice, freshly whipped cream and hot chocolate sauce. We chose -Extra White (felt like eating a white chocolate ice cream.)Wildberries (rich with flavours of berries, this is more of a sorbet, very refreshing.)Tiramisu (had hints of coffee, which is more dominant in a tiramisu icecream, but what special is that you could also taste the mascarpone cream cheese, simply loved it!)Orange Cheesecake Gelato (a new kind of ice cream, very different...", 4.5], ["It's a gem for ice-cream. Thanks to zomato we found this place in indranagar.We tried many of their ice-creams. They all were great, the lemon flavour and sweet-meat were the two, which we liked the most.We tired their crepe too, however, it wasn't that great.I would again go here especially to have their lemon flavoured ice-cream.", 4.0], ["Cozy lil corner to savor Italian crafted Ice creams . Try their French crepes n banana split sundaes. However their truffle ice cream is good too :)", 4.5], ["Absolute Value for Money and Great Taste.We can see few places a scope of Ice cream for INR 50, you have to take a combo of 2 scopes so minimum becomes INR 100, still worth the money.We tried Tiramisu, some whisky flavor and multiple rounds of chocolate and truffles.Creamy and full bodied", 4.5], ["we loved it.They also have sundaes and crepes. May be next time. Will visit again.", 5.0], ["This place serves THE BEST gelatos! They have the creamiest, greatest flavours. My favourite is the wine-based crème brûlée ❤️ Can't get enough of these gelatos. And they're so easy on the wallet. Truly value for money. Highly recommended.", 5.0], ["This place has the most amazing gelato in Bangalore. Lots of variety, cheerful ambiance, good service and top class quality! All this at reasonable price.", 4.0], ["Looking for a gelato parlour that has decent flavours and easy on your pocket? Then this just is 'The Place'If I lived anywhere close by", 4.0], ["I'd prolly end my day with a visit to Milano.", 4.5], ["Favourite one in entire Bangalore .. ideal way to finish a lazy weekend with their variety of amazing decadent ice creams .. wish they open more branches in Bangalore", 5.0], ["Had been here this evening.. Nice ambience... Tried the banana split with 3 different scoops of fig and almond, pistachio, truffle... Was yummy...most amazing was the wild berries scoop!! If you are the berry type you must definitely taste it...every bite is so refreshing... Tried it with sweet crepe drizzled with Nutella... I think I should have tried honey drizzled crepe rather.. to go with the wild berries.. Besides they have a variety of flavours and seems like they keep experimenting different flavours everyday...Happy with the icecreams ☺", 5.0], ["The best ice cream I have had in years.Was roaming through Indiranagar searching for the Pantaloon's showroom with friends. In between we understood that we lost our way..... and we stumbled up on this Milano outlet...I have been to the Kochi Milano and the taste of Ice Cream I had from there still lingers. So thought of taking friends to this branch in Indiranagar...Gosh... next 45 minutes... we just lost in the yummy ice creams.... different flavors... Ice cream is really creamy not the crystallized form that we get in other places..Guys never miss this place... One of the best places to have authentic ice cream at a very reasonable price !", 4.0], ["We r stayng very close to milano and use to b der once in a week.. so much awesomeness in everthing we find inside the shop, the cakes, the icecreams, the people..", 4.0], ["My friend and I dropped by this place during the weekend. The ambience is good. They serve only 2 scoops or more starting at Rs 100. The quantity was good for the price.We had the wildberris which I felt was too sour. And a chocolate one which was good. Nothing extra ordinary!Tasted the Nutella gelato, but there was not a tiny bit of Nutella flavour in there!If you're around this area, give it a try!", 4.5], ["This is located near CMH road in indiranagar opposite to costa coffee. It's a very small place. I wanted to try this ice cream for very long time. Milano had variety of ice creams. All the ice creams tasted real good. Finally decided to take sitapal and my friends chose wildberries, strawberry, Nutella, white chocolate and truffles. All the ice creams tasted very good. It's a must try !!!", 4.5], ["A gelato parlour owned by a italian person, That gives this place a good amount of credidblity by itself.The Ice creams here are pretty good, and have some very unique flavors like Spriguli .The sundaes are really good too.The ice cream cakes gave me brain freeze 😅😅.and The menu is really really cheap, Especially compared to BR, iBaco,etc .", 5.0], ["A very reasonably priced ice cream parlour with some amazing flavours. Loved their truffle, lemon and cheese cake flavours. The chocolate flavour was relatively less admirable.", 4.5], ["Been here so many times. Their ice-cream cakes are amazing and reasonably priced. Ice-creams", 5.0], ["5/5 Staff (friendly)", 4.0], ["5/5 Price", 2.5], ["5/5Ambience", 5.0]], "52459": [["I personally feel it's overrated place but nonetheless it's good place to have the benne masala dosa. It's usually crowded most of the time and one has to wait for good 15-20mins to get a place. The size of the dosa has drastically reduced over the period since it shot to fame. I soo wish it becomes the same CTR it used to be 10 yrs back", 3.5], ["Went to this place as I went to meet one of my frndz who stays near ms ramaiah  college... Read many reviews as well as recommendations from people I follow in this platform, had to stand for around 15 mins to get a seat was so jam packed... Ordered benne masala dosa must say they have perfected the art of how to make a dosa fluffy inside yet super crunchy outside was served with 2 chutneys the masala wasnt very spicy enuf btw and was loaded with ghee so if someone whozzz a health freak myt just think twice .... Anyways one of the best I tasted, den asked for mangalore bajji but was out of stock so tried their puri and kesari bath Which again was full of pure ghee.. It was also too good... Den tried their rava idly Which I must say that it was Nothing extra ordinary to be mentioned about and lastly finished off with a cuppa of coffee Which again was decent not very strong so a hardcore coffee lover may not rate it too much on the higher scale.... But anyways a very good place nevertheless", 4.0], ["Went to this place as I went to meet one of my frndz who stays near ms ramaiah  college... Read many reviews as well as recommendations from people I follow in this platform, had to stand for around 15 mins to get a seat was so jam packed... Ordered benne masala dosa must say they have perfected the art of how to make a dosa fluffy inside yet super crunchy outside was served with 2 chutneys the masala wasnt very spicy enuf btw and was loaded with ghee so if someone whozzz a health freak myt just think twice .... Anyways one of the best I tasted, den asked for mangalore bajji but was out of stock so tried their puri and kesari bath Which again was full of pure ghee.. It was also too good... Den tried their rava idly Which I must say that it was Nothing extra ordinary to be mentioned about and lastly finished off with a cuppa of coffee Which again was decent not very strong so a hardcore coffee lover may not rate it too much on the higher scale.... But anyways a...", 4.0], ["Again this find was based on Zomato and thank God for it. We had the pleasure of eating the best Upma here and later at MTR. Madly crowded, you have to almost stand on the head of people already eating. Sadly, that's the only way you would manage a table.Then, there are no menus and the only display menu on a wall was in Kannada which again didn't help. So had to ask the waiter what all was available. Idli wasn't but Upma and Masala Dosa was, so that was it and loved both.The Upma can not be softer and better while the Dosa is small, light but crisp. Sadly, you have to ask for Sambhar, that too would be served in very little quantity. Apparently, they don't want to get into serving it with so many people around. Had the Filter Coffee to end the meal and went more crazy.Missed Sambhar badly but loved the food. And, it is super cheap.", 4.5], ["We are not from these parts and had been negligently oblivious of the existence of this iconic place. That was destined to change one evening as were driving to Mantri Square Mall and saw this old looking building and were quite curious to know why so many people were standing inside and at the entrance door. A few google searches later, we decided that we just have to come here. We parked at the mall and walked to this place, soaking in the ambience of the streets of Malleshwaram. We finally reached and it was an amazing atmosphere despite all the crowds and the chaos. A few minutes of struggle later, we found ourselves sharing the table with another party. No menus here and everyone seemed to know what to order. We didn't and the only kannada menu on the wall by the counter didn't help either. The friendly waiter suggested in part kannada and part sign language and we exchanged the magical words of Dosa and Kaapi and that was taken care of. A few minutes later, the famous Benne Dose arrived. A small dosa, it was both thick and crisp and the filling was super tasty. One bite and we knew what we had been missing all these decades. The 2 chutneys", 4.0], ["Pudina and normal coconut were also ever so tasty. We literally devoured the dosa in minutes and washed it down with an excellent filter coffee.CTR", 4.0], ["you have added new fans and we would come here as often as we can.​", 2.0], ["We are not from these parts and had been negligently oblivious of the existence of this iconic place. That was destined to change one evening as were driving to Mantri Square Mall and saw this old looking building and were quite curious to know why so many people were standing inside and at the entrance door. A few google searches later, we decided that we just have to come here. We parked at the mall and walked to this place, soaking in the ambience of the streets of Malleshwaram. We finally reached and it was an amazing atmosphere despite all the crowds and the chaos. A few minutes of struggle later, we found ourselves sharing the table with another party. No menus here and everyone seemed to know what to order. We didn't and the only kannada menu on the wall by the counter didn't help either. The friendly waiter suggested in part kannada and part sign language and we exchanged the magical words of Dosa and Kaapi and that was taken care of. A few minutes...", 5.0], ["Being Bangalore's one of the renowned places had very high expectations to have exceptional dosas.  Only my disappointment was high. After waiting for around 20mins for a table, the waiter had no interest to take our orders. Got us half the stuffs n forgot a few. The dosa was just as average as you find at any dosa outlet around. The kara bhath was tasteless rava with some salt n seasoning added jus for heck of it. Rava idli was even worse. The only tasty dish was kesari bhath. Would prefer Siddanna or umesh dosa camp any day over this place.", 5.0], ["Shiv Sagar or more famously known as CTR is my Bangalore favorite. Their Benne Dosa's are simply simply amazing. I really gape at their ability to make a thick Dosa crispy! Must be the copious amounts of butter, bht hey, I'm not complaining. I had the plain Benne Dosa and also the Mysore Masala (which comes with the red chutney and Masala inside the Dosa). And I'm always in bliss after eating here. Loved it!  And will keep coming back for more!", 5.0], ["The best dosas this side of the Equator, and they don't make dosas on the other side. If I was in prison on death row, this dosa would be part of my last meal. If I was stuck on a desert island and could have only one thing to eat, this dosa would be it. I haven't really eaten anything else at CTR. But their benne masala dosa and filter coffee will make you weep with joy at how good a dosa can be. To all the Vidyarthi Bhavan lovers out there: CTR is better. Sean Paul even sang a song about Vidyarthi Bhavan's jealousy, called 'VB burning'.", 5.0], ["Probably one of the best dosa's you can lay your hands on! Located in the busy streets of Malleshwaram and has been one amongst the oldest serving restaurants still serving our heritage on a plate! Ctr is typically known for its yummy Benne Masala Dosa's. It had been ages since I had visited ctr and today finally got a chance to visit it again. The place is open till 12:30 in the afternoon and we were right on time. Even though it was not a typical breakfast time, it was still pretty crowded. The interiors are normal and a bit congested but who cares as long as the food at the end of the day is great! Ctr has 2 floors for seating so you can find quite a number of tables to sit at. Since it was closing time and waiter insisted us to order everything at once, we went ahead and ordered their specialties 1. Benne Masala Dosa: Really crispy dosa's @cause of the butter that is added to it. Served alongside the normal coconut chutney and then a Pudina chutney. Every bite of the Dosa, you get that wonderful taste of the butter. Who doesn't love butter? The dosa's are relatively small and could easily have 2 of them at once. The potato pulya was also yummy and I would gladly say it was something which everyone in Bangalore should try! 2.Coffee: Normal Strong Filter coffee which we had to end the yummy meal! The servers are quite nice and comfortable to talk to  and Each dosa is like 50 bucks which is really good for the quality we get. An amazing place and will keep visiting as in when I can!", 4.5], ["Probably one of the best dosa's you can lay your hands on! Located in the busy streets of Malleshwaram and has been one amongst the oldest serving restaurants still serving our heritage on a plate! Ctr is typically known for its yummy Benne Masala Dosa's. It had been ages since I had visited ctr and today finally got a chance to visit it again. The place is open till 12:30 in the afternoon and we were right on time. Even though it was not a typical breakfast time, it was still pretty crowded. The interiors are normal and a bit congested but who cares as long as the food at the end of the day is great! Ctr has 2 floors for seating so you can find quite a number of tables to sit at. Since it was closing time and waiter insisted us to order everything at once, we went ahead and ordered their specialties 1. Benne Masala Dosa: Really crispy dosa's @cause of the butter that is added to it. Served alongside the normal coconut chutney and then a Pudina chutney. Every...", 4.5], ["A totally vintage dosa place situated perfectly in the cradle of old Bengaluru. This place will give you the feel of old school and those vintages interiors leaving you nostalgic.! I feel guilty of not visiting even after being in Blore for so long.! You are absolutely not a true Bangalorean if you haven't eaten at this place. So I finally dawned my outcast status and ventured her for a gastronomical journey with my fiancé.! We had a rava idli, their trademark bene (butter) masala dosa, plain bene dosa and filter coffee (can't do without this). Trust me your visit to this place is incompetent w/out having their bene masala dosa. Honestly, the rava idli was not so great but the dosas were piping hot, crispy and glazing (because of the butter). I really haven't had such delicious dosa before.! Would certainly keep going to the place :)", 4.5], ["CTR the most popular and the oldest South Indian fast food restaurant. Located in the most iconic area of Bangalore, the Malleshwaram. I visited the place on a weekday for breakfast, it was the office crowd who were there for a quick grab in the ground floor and rest casual diners in the first floor. It's an old building located at the corner of a street. The ambience is pleasant, cultural, historical, rustic and busy. Their bestseller is the Masala Dosa, for which the restaurant has won numerous awards.   I ordered the famous Benne Masala Dosa, Poori, Idli, Vada and Coffee.   Started off the breakfast with quick bites of Idli and Vada. They were served with Coconut Chutney and Sambar. The Vada is deep fried, crispy outside and soft, moist, crumbly inside. The crunch sound while taking bite gives all the pleasure in the world. The sweet and sour sambar is a great accompaniment along with the vada.    The Idlis are steamed and thus super soft. It's crumbly, fermented, fresh, hot, light, moist and flavourful. The Chutney has a salty, spices and grated coconut flavour.The Benne Masala Dosa is served with Potato Palya and Pudina and Coconut Chutney. The Dosa is thick, cooked with some extra butter and looks Mouthwatering. The outside is rigid, crispy and shallow fried to deep brown colour, while the inside is soft, crumbly and moist. The Dosa was well cooked and tastes Divine with the accompaniments.   Poori is served with Coconut Chutney and Vegetable Saagu. The Pooris are nicely soft and puffed up, crisp on the top and thick in the bottom. It's a stomach filler, and tastes spicy, sour and oily along with Saagu. The Saagu could be better.", 4.5], ["CTR the most popular and the oldest South Indian fast food restaurant. Located in the most iconic area of Bangalore, the Malleshwaram. I visited the place on a weekday for breakfast, it was the office crowd who were there for a quick grab in the ground floor and rest casual diners in the first floor. It's an old building located at the corner of a street. The ambience is pleasant, cultural, historical, rustic and busy. Their bestseller is the Masala Dosa, for which the restaurant has won numerous awards.   I ordered the famous Benne Masala Dosa, Poori, Idli, Vada and Coffee.   Started off the breakfast with quick bites of Idli and Vada. They were served with Coconut Chutney and Sambar. The Vada is deep fried, crispy outside and soft, moist, crumbly inside. The crunch sound while taking bite gives all the pleasure in the world. The sweet and sour sambar is a great accompaniment along with the vada.    The Idlis are steamed and thus super soft. It's crumbly...", 3.5], ["Finally after a long wait, today I went to this place with my friend. As soon as we entered we got place to sit. When server came to ask our order without hesitation we ordered two Benne Masala Dosa.. For this only I travelled 20kms early on Saturday morning.. So I was  eagerly waiting for my Masala Dosa and finally it came..  The Dosa was so rich in butter... You can feel that when the first piece goes into your mouth.. This is one of the best Masala Dosa I ever had in Bangalore.. So when I finished my first Dosa I ordered again one more Masala Dosa and my friend ordered Kesari bath and coffee.. I never drink coffee but when my friend described about the coffee I really wanted to try... This was our experience in CTR today.. Everyone in Bangalore should go and taste their food...", 5.0], ["Just Visited Today Morning After Waiting from longgggggg Waits .It was Too Crowed  Place and hard to get place for 4 members .We ordered benne Masala Dosa,chow chow bath,Kara bath for Morning Breakfast it taste was superrr nice to have Breakfast here and bit dis pointed  about the breakfast items are limited available in the morning after 9.00 AM  here .Actually We wanted to order Mangalore Bajji and poori , Vada  but its not available .Mangalore Bajji availabe after 4pm .We came out bit sad after hearing bajji available after 4pm .We will try next time for bajji.", 4.0], ["Had the benne dosa, it was beyond beautiful. Thick, crisp, buttery and so so wholesome. A must must try along with their filter coffee. Priced at just 150 bucks this is a real steal deal.", 4.0], ["Shri Sagar (CTR) aka Central Tiffin Room is the oldest South Indian breakfast place in Bangalore.Its Benne Dosa also called as the Malleswaram Dosa has been unanimously awarded as the best Masala Dosa in the country by various food critics and most importantly, The Hindu. I take The Hindu very seriously. No nonsense.On our recent trip to Bangalore, our trip would have been incomplete without a meal at CTR. Had it for dinner on Day 1. I like to be in the company of legends. I am as old school as they come. Nonetheless, I never enter biased. Never.How we three love regular veg South Indian food! In my review of Vinayaka Mylari in Mysore, I have elaborately explained what bastardization of food is. Here too, we were enlightened about the bastardization of the Dosa and we discovered a gem of a food item which none of us had ever discovered in Mumbai.FOOD: 4.5/5", 4.0], ["Shri Sagar (CTR) aka Central Tiffin Room is the oldest South Indian breakfast place in Bangalore.Its Benne Dosa also called as the Malleswaram Dosa has been unanimously awarded as the best Masala Dosa in the country by various food critics and most importantly, The Hindu. I take The Hindu very seriously. No nonsense.On our recent trip to Bangalore, our trip would have been incomplete without a meal at CTR. Had it for dinner on Day 1. I like to be in the company of legends. I am as old school as they come. Nonetheless, I never enter biased. Never.How we three love regular veg South Indian food! In my review of Vinayaka Mylari in Mysore, I have elaborately explained what bastardization of food is. Here too, we were enlightened about the bastardization of the Dosa and we discovered a gem of a food item which none of us had ever discovered in Mumbai.FOOD: 4.5/5", 4.5], ["Delicious benne masala dosa. Went on a Sunday afternoon 5 minutes after it opened and could barely find an open table. Ambience is predictably casual, not important. Service is prompt.", 4.0], ["This place is Sunday starter. Amazing dosas and vada. Speed service.  Over loaded crowd,  best to go. Early mornings. Bangalore is known for such places and this is one of the oldest and famous place. #Regularvisitor", 4.5], ["Best Dosas. Visit this place for probably the Best Benne Masala Dosas in Bangalore... They also have the other breakfast regulars, but everyone starts with the Dosa....If coming here on a weekend, best you start early and inform the waiters of your presence if there is a rush, wait times are around 10 mins to be seated. You probably would...", 4.5], ["Best benne masala dosa in Bengaluru ❤❤❤The place is filled at 8.30 in the morning with people from everywhere. We waited for about 10 minutes to even get a table. But all that is forgotten once they serve their mouth watering benne masala dosa. The service is super quick even though there are so many people pouring into this old Tiffin Room. Gonna come back here quite often from now :D", 4.5], ["Bestest dosas in Bangalore. Located on the main Margosa road, this corner store is always full. It's my favourite one .I've tried MTR, Janardhan, umesh dosa, chalukya. Name it. But CTr kills it for me. The benne plain is ultimate. If your in for an overload of ghee ,crispy golden dosas ,you are in for a treat. The red chutney they put inside the dosa is delicious.The ghee dosa goes perfectly with their filter coffee which is nice an strong.it comes in traditional steel glasses. The staff is polite and always around . This place is a quick meal one but be prepared to wait for a table. It's a sharing tiffin system so nothing fancy about it but great food and great quality.", 5.0], ["Amazing benne dosa served here. The place is always over crowded but worth the wait. Would appreciate if they start up with token system to get in .....", 4.5], ["AMAZING PLACEThis place is known for THE BEST MASALA DOSA in whole of Bangalore.BLURRP certified -one of its kindThe benne masala dosa is so crisp and so tasty that you end up eating 2 at a time.The mangalore bajji is also good. Priced at Rs 45 for a dosa value for money.Staff very polite and quick...On weekends too crowded and need to wait 20-30 minutes Parking God help us...MUST VISIT IF U R IN BANGALORE", 4.0], ["This place is known for its amazing Dosas.It is a very famous place and usually crowded . Their dosas certainly never disappoint you. Visit this please whenever you have time.", 4.5], ["Finally managed to visit the much heard about  breakfast joint. It was a Saturday morning and the place was full to the brim. We had to stand next to a table, I bet the diners were pestered with our hungry eyes waiting for them to vacate the seats just as we felt when others waited to find a seat. Amazing benne dosa and commonplace chutney. The rava dosa didn't pass muster too. Good coffees.  Will go back for the benne (butter) dosa.", 4.0], ["All the dosa lovers out there, this is your place! By far one of the best dosas I've had in Bangalore! Hot Mangaluru bajjis served with chutney could make a nice evening snack. Love the Rava idlis and kharabath too. Such substantial food for much pocket friendly prices.", 4.0], ["Known to be one of the legendary restaurants in Bangalore, i have been planning to visit this place for a long time. I finally got a chance to visit it  last Saturday. Very easy to locate in Malleshwaram in front of by 2 coffee, you will realize how great this place is with the crowd you see outside. I had always heard its very crowded. And it surely was. It took me 10 minutes to find a seat but the wait was worth it. While we sat, the service was real quick. The waiter came for the order. I was a lil surprised to know they dont have the menu, so i asked him to help me with the order placing. With his help, we ordered puri sabzi, rava idli and benne dosa. This place has received various award and one of it was for benne dosa, so i had to try that out. Puri sabzi came, a set of 3 puri and sambhar. I wanted  aloo along so i asked the waiter an he got it without any hesitation. The poori bhaji was amazing. Then came the benne dosa, i lved how crisp and tasty it was. Mouthwatering literally, served with sambhar and amazing coconut white chutney which i ate entirely. Then came rava idly, the idly was good. We then ordered filter kaapi. Amazingly strong taste. Overall an amazing experience. The staff is great. Service is quick and a pocket friendly place. Do try.<span></span>", 4.5], ["Known to be one of the legendary restaurants in Bangalore, i have been planning to visit this place for a long time. I finally got a chance to visit it  last Saturday. Very easy to locate in Malleshwaram in front of by 2 coffee, you will realize how great this place is with the crowd you see outside. I had always heard its very crowded. And it surely was. It took me 10 minutes to find a seat but the wait was worth it. While we sat, the service was real quick. The waiter came for the order. I was a lil surprised to know they dont have the menu, so i asked him to help me with the order placing. With his help, we ordered puri sabzi, rava idli and benne dosa. This place has received various award and one of it was for benne dosa, so i had to try that out. Puri sabzi came, a set of 3 puri and sambhar. I wanted  aloo along so i asked the waiter an he got it without any hesitation. The poori bhaji was amazing. Then came the benne dosa, i lved how crisp and tasty it...", 5.0], ["Shree Sagar or CTR as it is more popularly known is a landmark breakfast joint in Bangalore. And for good reason. Their delicious iconic Benne Masala Dosas help you forgive all the butter/ ghee rather easily. If there was just ONE thing we were allowed to have for the rest of our lives, it would be their benne saagu dosa. . yumm!They also sell some of *the* best mangalore bajjis in town, so don't forget to try them the next time you visit CTR!", 4.5], ["What can be said about this place, as it is an icon food joint and has been here from ages.I remember visiting this place for breakfast on weekends after a tiring sports session at Malleshwaram grounds. Taste at its best and service is super fast.The quantity, quality and freshness of the food gives one a real kick. The mangalore bajji is an attraction by itself in the evenings.Reminds me of the old Bangalore that we have been  used to.", 4.0], ["One of the most delicious food joints in banglore.The best manglore bajji's you can get. Don't miss the delicious Benne dosas over here. Aboslutely worth the visit. Love it💞", 4.5], ["Another landmark restaurant of Bangalore ! The place is always crowded and is known for its legendary benne masala dosa and golibaje! The dosa today was a bit too crisp ! The palya was good ( mushy and with onions).  The coffee strong and was served hot !", 4.0], ["One of the oldest restaurants of bangalore. Famous for its benne dosa...worth a visit for dosa lovers you get crispy,tasty dosa made in ghee...No great ambience just like a local hotel.There would always be a queue but moves forward quickly. The service is good..", 2.5]], "55642": [["I went with my freind to have a snack the price is over the moon and the taste n food presentation is not value for money the ambiance is OK  as it is in the food court of gopalan grand mall", 3.5], ["Surprised at the low ratings ... Though other items in menu are average but You get one of best Kanchipuram masala dosa here. Strongly recommend it", 3.0], ["Unnecessarily costly.. Landed up here bcoz there was no other option in gopalan..   Someone can get the same on the roadside or even better with 1/10th of the cost", 1.0], ["I'm going to make this review short and sour like our experience at this outlet : mundane fare,  overpriced and poor food service system.  Staff are uninterested. Couldn't wait to leave. Ordinary is an overstatement.", 2.0], ["If you are an ardent Idli fan, wouldn't mind recycling the leftover idly to Upma, not just a fan of authentic Idlis but also the modified versions of it, also don't care spending extra bucks for Idlis in the mall, then you wouldn't mind trying Mr. Idli. So Mr. Idli is located amidst various food outlets in Gopalan Signature Mall. Its not a fancy setup, its a regular outlet in the food court with comfortable seating.", 3.0], ["Mr. Idli is not only just about varieties of idli. They have many other things which are pretty good. For eg. their Dosas are absolutely tasty. They can easily give A2B a run for their money. They are located on the second level of the Gopalan Signature mall. The cashier/owner (I guess so!!) is very polite. Service is quick.If you are in Gopalan Mall, you can stop here for a quick bite of South Indian food. It also doesn't dig a hole in the pocket aa well.", 4.0], ["We have ordered dosa, idli, and some chinese fusion idlis. Very very overpriced south indian food. Very bad service. Greasy oily idli manchurian. sambar was yuck.. Never going to visit that outlet again", 1.0], ["Average Overpriced Idlies are served and the service time is really bad. The staff are rude and half the menu items are not available even in peak times on weekend. Have eaten twice and am probably not visiting again.", 2.0], ["Mr Idli furnishes a menu that is unique among most vegetarian restaurants with ample varieties of dishes. Boy! I couldn't make up my mind. The ambience and price is alright. Most of the dishes are at standard rates while a few are overpriced. The service is quick but and organised. The food is delicious. A shout out to Mr Idli! A must try. Overall, a filling and satisfactory dining experience.", 4.5], ["Lack of choices at early hours landed us to this outlet. Must say name sounds good, the mascot is enticing and all the goodness ends right there. We ordered button idlis with ghee sambar and let me tell you it was the worst sambar i have had in a long time. Idlis were good but the sambar was absolutely bland. It is outrightly, outrageously overpriced food that may leave you questioning your sense of discernment.", 1.0], ["Was such a mistake to visit this restaurant at the Gopalan Grand Mall. We ordered Masala Dosa, Chol Bhature, Uthapam and butter milk. Everything was so disappointing that we felt like puking after half the food. We just left the food half eaten.Now their food -The food was tasteless, probably stale as well. Their service was fast as probably very few orders were received.You should compare the footfall with Mast Kalandar which is always full even though it is North Indian.", 1.0], ["One of the few restaurant that weave ambience, taste and hospitality into one thread to provide great customer experience. Well this is one of the most lavish places where I have been so far. The ambience is just a bliss. Food was mind blowing, the service and courtesy of the staff and the manager is really excellent. It’s worth. Thanks Mr Idli", 4.5], ["The worst hotel i ever went. No fresh idli. Service is very fast as nothing is freshly cooked. All preserved frozen and heat before served. Chutney was stale. I can't even compare with any roadside hotels", 1.0], ["I decided to come here after some shopping! I saw the menu and ordered a Mysore Cheese Rocket Dosa! I wanted to give this a try! My word its delicious! It looked nice and was quite different from other regular dosas. The cheese was nicely spread and podi was good! I was very happy the quality of the Dosa. I'd love to come here again! This place will fill your stomach! Must try Mysore Rocket cheese Dosa!", 4.0], ["Today we went there and ordered Kanchipuram Dosa (that was their special dish for the day (Saturday)) and Idli Manchurian. Idli Manchurian was good but not exactly happy with the dosa. It's really overpriced as with the price of 120+ , I feel it is really costly. In Bangalore you'd get better places which is having much better value for money. I don't like the taste of Sambar too, served with Dosa. Overall I could have given 3.5 but due to price I finally settled to mark 3 rating", 3.0], ["This place surprises one with explosive food on one hand and some let downs also on the the other. Visited this place for a quick bite as well as for a meal", 3.0], ["can't say I was disappointed. It has more pluses than negatives and with just a few tweaks can be a very good joint. Worth giving a try!", 4.0], ["Went to this place as we were very hungry after some shopping @Gopalan signature mall. Ordered a Mysore Rocket Cheese masala dosa. I was fascinated by this fancy name and decided to try it.", 3.5], ["Its okkkkkaaaayyy place but expensive... dosa batter wasnt tadty n sambar n chutney had kind of dour smell n tadty... not upto the level of pricing...", 4.0], ["Located inside gopalan signature mall. Staff is nice. Self service. Have tried idli only. Not so pricy. And yes Idli manchurian is a must try.", 2.5], ["Went to this place on a Sunday morning. Had Mini Idlies with sambar, Bombay special open dosa, Idly manchurian and coffee. Sambar was good. Open dosa is just an Uthappam (which is very very thick) with some podi, aloo sagu on it. Nothing special, and was not expecting that way. Idly manchurian was nothing like a manchurian. I think they ve added red colour fried it in a bit of oil and added spring onions, tomato sauce and onions. I was tasting the tomato sauce all over it. Bad... May be i was expecting too much for it. But all the above costed around 350 which i think is a bit highly priced. Coffee was good though!", 4.0], ["Looking for South Indian food in a resto, you've got it here. All kinds of dosa and other things. Whenever we feel like South Indian from outside we come here. Food is fine here as it should be.", 5.0], ["South Indian Food is the best way to stay healthy. However we were a bit sceptical about eating out.However coming to Gopalan Signature Mall and ordering food at Mr.Idli, we found ourselves enjoying the ambience and literally devouring the food. We ordered a lot of items, of which I loved the Onion Dosas as well as the rava idlis. I can conclude by saying that this is definitely the place, where it feels like a home away from home and you can enjoy the taste of delicious home made food.", 2.0], ["Mr. Idli is too costly for having Idli's.  It's costs me around 100 rupees to fill my stomach with Idli's there,  but outside at normal eatery it costs me only 40-50 rupees.  It's not worth going there", 3.5], ["Now, a wide variety of Idlis is something you will find only at this place. I visited this restaurant and had the food in a hurry as I was supposed to catch 10 pm movie :) . This one is situated in Gopalan Signature Mall, Old Madras Road.Loaded Onion Uthappam is simply superb here. As the name suggests, the Uthappam is actually loaded with a LOADS of onions I must say. Button Ghee Idly with Sambar is equally delicious. Mulagapudi Ghee Idly is something you must not miss. Button Idlis are soaked in a powder (probably made of garlic and other stuff) and later Ghee is sprinkled on the Idlis. Really, really tasty. Sambar is of great taste. I think they can improve the taste of chutneys. They are OK but not the best.", 2.5], ["I put up in Kasturi Nagar, and this is one of my closest hangout places. I have tried everything in the mall, apart from this. Finally, I went with my friends to the place. The food is OK, i liked Idli Machurian and Chilli Idli, apart from this Rava Dosa and Onion Uthapam were Okish.Its a nice place for light food.The cashier and the waiters are good people to talk to.", 3.5], ["Amazing place for snacking. Love the Mini Idli and Uttapam options. The chutneys are fresh and super tasty.", 1.0], ["Worst idly available in Bangalore. Waste of money. Chutneys I guess they prepare in the morning and setve entire day. Cant cut the idly with a spoon so hard.", 1.0], ["Worst serviceWorst qualityPrices very high.", 3.5], ["I had seen Mr Idli during one of my previous visits to the mall, but had not tried it. Last weekend I happened to be at the mall and had to find some place for lunch. As I was alone, I wasn't looking forward to an elaborate meal or anything. Hence Mr Idli! It is an open seating area within the mall and the decor and seating is pretty basic. Although there were many items listed in the menu, I was informed that for lunch only Meals and Dosas were available. I would have preferred Bisi Bele Bath, but that wasn't available :(. I could see several kinds of Dosas, and some of them with interesting combos.. For example the Taco Noodle Dosa. Not one to take such big risks I settled for the American Corn Pudina Dosa. Cost me 110 bucks, and I was given a token. Service was quick; the fact the place wasn't fully crowded helped. The Dosa was basically made with green colored batter with american corn sprinkled inside, and served with red and white chutney and sambar. The Dosa was crisp and roast, just like the way I prefer. It green color did not make much of a difference to the taste. The corn tasted like it was just taken off the freezer! Apart from that everything else about the Dosa was good. It was quite filling. I had to go back for extra chutney and sambar given how less they served in the first place. Except for the cold corn, I was pretty happy with what I ate. Prices are little on the higher side, so I hope they become a little more generous with the Chutney-Sambar quantity :-)", 3.5], ["I had seen Mr Idli during one of my previous visits to the mall, but had not tried it. Last weekend I happened to be at the mall and had to find some place for lunch. As I was alone, I wasn't looking forward to an elaborate meal or anything. Hence Mr Idli! It is an open seating area within the mall and the decor and seating is pretty basic. Although there were many items listed in the menu, I was informed that for lunch only Meals and Dosas were available. I would have preferred Bisi Bele Bath, but that wasn't available :(. I could see several kinds of Dosas, and some of them with interesting combos.. For example the Taco Noodle Dosa. Not one to take such big risks I settled for the American Corn Pudina Dosa. Cost me 110 bucks, and I was given a token. Service was quick; the fact the place wasn't fully crowded helped. The Dosa was basically made with green colored batter with american corn sprinkled inside, and served with red and white chutney and sambar. The Dosa...", 4.5]], "58243": [["Kids love the place..Mandarin feast, mushroom satay, soya dumplings, Thai green curry, pad Thai..Hakka noodles are their favorites...the ambience is great and the service very friendly...", 4.0], ["Great place. One of the most yummiest dishes I tasted here was the Tom Yum soup,it was simply too good. Som Tum Thai,a very different salad that I tried was delicious! Also,the chilly tofu and chilly garlic noodles were spicy and yum. Ambience is very colourful and lively! Overall experience was too good.", 4.5], ["Had bookmarked this place from a very long time and finally got to visit. Tried the barbecue chicken buns, a lamb gravy that was recommended, chilli garlic rice and a fried ice cream. Also had the ringer and Asian Mary. The drinks were excellent. The barbecue bun is highly recommended. The rice was average though and probably the only disappointment. The fried ice cream was good as well. On the whole a very good experience and highly recommended!", 4.0], ["What a delightful place to have lunch. The only downside is that it's too crowded at times, reservation is recommended. Food comes in nice portions, enough for two. The ambience will take the cake anyway. The place is as immaculate as it gets. Choose less crowded hours and you'll never forget the place.", 4.0], ["Went to Tim Tai with a lot of expectations, had heard from friends this is a great place for Asian food. I must say I was a bit disappointed. The Shanghai Chicken Dimsum was the best of the lot, it was really yummy, non spicy for the kids, and they loved it. The crabmeat omelet was a disappointment, there was no salt, and the crab meat was not soft, may be it wasn't fresh. The egg fried rice was good. The dessert, apple fritters with blueberry compote and ice cream was bad. The fritters themselves were bland, the apple not sweet, and the batter used for the fritters not tasty. The blueberry compote didn't help, there was too little of it. The fritter needs to be sweeter. Somehow it didn't work for me. The place is fantastic though, well lit, beautifully decorated, and that tree in the middle is very well placed. Tim Tie deserves another try, will definitely go without kids and try the spicy stuff. That will decide.", 3.5], ["The first thing that struck me about Tim Tai was the colourful ambience and the cheerful vibes that envelop the place. We had gone for a weekend lunch, which is conventionally considered to be a quiet affair at restaurants, but this place was just teeming with liveliness. The wonderful decor, done up in sober shades of yellow, peach and brown, must have been a catalyst. A tree stood right at the center of the establishment, which seemed to hold the place together. And on the side farthest from the entrance was a small area secluded by a glass wall, with a mini waterfall inside. Yes, a waterfall. Unfortunately, this area was out of service for some reason, and it was during my visit to the washroom that I came across this beauty.  As for our order, unluckily, I don't remember the names of the dishes that we had ordered (feel free to caption in comments the photos that I have uploaded), other than the basket of steamed momos. What I do remember is that all the items were quite satisfactory and filling, especially the momos. Moreover, I had already fallen in love with the place, and the preparations would have had to be horribly bad to change my mind.   Tim Tai definitely deserves a visit, as much for the interiors as for the food. And don't forget to order their steamed momos if you do make it there.", 4.0], ["The first thing that struck me about Tim Tai was the colourful ambience and the cheerful vibes that envelop the place. We had gone for a weekend lunch, which is conventionally considered to be a quiet affair at restaurants, but this place was just teeming with liveliness. The wonderful decor, done up in sober shades of yellow, peach and brown, must have been a catalyst. A tree stood right at the center of the establishment, which seemed to hold the place together. And on the side farthest from the entrance was a small area secluded by a glass wall, with a mini waterfall inside. Yes, a waterfall. Unfortunately, this area was out of service for some reason, and it was during my visit to the washroom that I came across this beauty.  As for our order, unluckily, I don't remember the names of the dishes that we had ordered (feel free to caption in comments the photos that I have uploaded), other than the basket of steamed momos. What I do remember is that all the...", 4.0], ["A pleasant setting and smiling faces welcome you to this place .As a lover of Asian food it pretty much satisfy my hunger however wish they had a slightly more elaborate spread.", 3.5], ["First thing one notices on entering the place is the colourful ambience. Its all very soothing to eye in its pink, green and yellow. We were a group of 5 with 3 females and especially the females were in awe of the ambience. To start it off, we ordered a dimsum platter. There were only 8 pieces which were kind of less for 5 of us. So we ended up sharing. I could only taste 2 out of 4 types and liked one of them due to its spicy taste. I am not good at remembering chinese dishes but we ordered a noodles, a rice and 2 veg dishes. All i can at a broad level was that the food was amazing. Things like lotus stem were a part of veggies which I have very rarely seen. All in all, a good dinner outing.", 4.5], ["This place has a great ambience along  with the food. Ordered red curry and pad Thai. I can definitely say that red curry was one of the best I have tasted. Pad Thai was also good. Ordered fried ice cream for desert and that also didn't disappoint. It had a green tea flavour due to which it had a unique taste. Service was okay. Lovely place to hangout with friends and family.", 4.0], ["The vibrant pink n yellow decor gave me a happy feeling as I entered Tim Tai! There is sufficient seating and the setup doesn't make it seem over crowded at all. The place for Thai and Chinese cuisines, Tim Tai doesn't disappoint. Flavours are far more authentic than the usual Indianized Chinese that we find in most places. Definitely recommended.", 4.0], ["This was one place that I wanted to go to for a very long time. So friends and us came here for Sunday lunch. My first impression", 4.0], ["absolutely lovely decor. Whoever did the decor of the restaurant has wonderful taste. We arrived and were seated immediately... Since there were six of us we ordered for the following  Drinks", 4.0], ["cinnamon and orange iced tea, Mandarin feast, Asian Mary and one Lady love.  Starters", 4.0], ["spicy Soya and basil dimsum, Thai styled grilled chicken with green apple Som Tam, Lotus stem with honey chilli and a Tom yum soup  Main course", 4.0], ["Thai red curry, Burmese curry with plain rice, phad Thai noodles and lamb and leeks with black pepper sauce.  We all loved our drinks except for the Mandarin drink everything else was fresh and flavourful. Asian Mary was absolutely perfect in terms of flavour. Right mix of basil, Tabasco and guava. The soup was clear and had lots of vegetables with a strong hint of lemon grass. Light on the tummy. We enjoyed all the starters", 3.5], ["the marination on the chicken was absolutely perfect and it looked as if it had penetrated the chicken completely. Wasnt too charred too. Served with the green apple the sweet and sour balance of flavours was spot on. I have to say the Lotus stem surprised us all. Fried and coated in honey chilli sauce it was perfect. Dimsums were moist. Slightly chilly for me but didn't lack any flavours.", 4.5], ["This was one place that I wanted to go to for a very long time. So friends and us came here for Sunday lunch. My first impression", 4.5], ["absolutely lovely decor. Whoever did the decor of the restaurant has wonderful taste. We arrived and were seated immediately... Since there were six of us we ordered for the following  Drinks", 4.5], ["cinnamon and orange iced tea, Mandarin feast, Asian Mary and one Lady love.  Starters", 4.0], ["spicy Soya and basil dimsum, Thai styled grilled chicken with green apple Som Tam, Lotus stem with honey chilli and a Tom yum soup  Main course", 4.5], ["Thai red curry, Burmese curry with plain rice, phad Thai noodles and lamb and leeks with black pepper sauce.  We all loved our drinks except for the Mandarin drink everything else was fresh and flavourful. Asian Mary was absolutely perfect in terms of flavour. Right mix of basil, Tabasco and guava. The soup was clear and had lots of vegetables with a strong hint of lemon grass. Light on the tummy. We enjoyed all the...>Rahul D'Souza", 4.5], ["Went to Tim Tai for lunch twice and was impressed both times.  The Shanghai noodles for vegetarians is a must to try!  Like the way the staff handle the traffic of people.   Going back soon.", 5.0], ["A very attractive entrance you won't miss seeing this place if you have visited the food street of KoramangalaA beautiful ambiance and Asian cuisineWe started with the Chinese baby corn signature starter. Some dim sim which was served with a spicy red sauce. Loved it.Spring rolls became our main course as we were too full to go for the traditional main course.The brownie dessert was a good and to our Asian meal here. The staff was very helpful. Not crowded on weekdays. Beautiful ambiance to top the experience.", 5.0], ["If you have love for dimsums, this place is for you guys. We tried their steamed dimsums which were very yum. But we wanted to try their deep fried dimsums too, which turned out to be very bad. Dint like it at all. This place is quite big and is a family restaurant. I loved their decor it was quite cool.", 4.5], ["Such a pretty and quirky decor. It was the first thing that caught my eye! Food was great and pocket friendly. Service good too. A must visit if looking for a casual asian dinner in the Koramangala area.", 4.5], ["Tuesday evening at 9pm Tim Tai had made its mark as one of the good restaurants which was here to stay in the sea of restaurants in that area. I visited this place for the first time and had high expectations from it. Me and my friend were seated almost centrally in the restaurant where they have an indoor tree feature. The ambiance was nice and our waiter was courteous. We placed the order for vegetarian Satay platter and nasi goreng. For the beverage we went with mandarin feast and lemon grass. The drinks didn't take much time to come and tasted good. We loved the flavour that was infused and the fact that it was not brain freezingly cold or diluted. The starter arrived soon and looked heavenly. We loved the peanut sauce that came with it. They nailed the Satay unlike other places which just serve meat or veggies on a skewer. The flavour was authentic and the dish was presented well. The main course was the star of the show. Nasi goreng which literally translates to fried rice was upscaled and brought back memories of Indonesia. The fried garlic and onions added to the taste. We contemplated about having dessert but decided to have more food. We went ahead and ordered Indonesian bamee noodles. The flavour was very similar to the rice and we realized we should have ordered something else but we can save that for next time. This place has amazing food and good service. Recommended for days you crave for south East Asian cuisine.", 3.0], ["Tuesday evening at 9pm Tim Tai had made its mark as one of the good restaurants which was here to stay in the sea of restaurants in that area. I visited this place for the first time and had high expectations from it. Me and my friend were seated almost centrally in the restaurant where they have an indoor tree feature. The ambiance was nice and our waiter was courteous. We placed the order for vegetarian Satay platter and nasi goreng. For the beverage we went with mandarin feast and lemon grass. The drinks didn't take much time to come and tasted good. We loved the flavour that was infused and the fact that it was not brain freezingly cold or diluted. The starter arrived soon and looked heavenly. We loved the peanut sauce that came with it. They nailed the Satay unlike other places which just serve meat or veggies on a skewer. The flavour was authentic and the dish was presented well. The main course was the star of the show. Nasi goreng which literally...", 3.0], ["Cool ambience. Valet parking available. Went here with a bunch of colleagues to taste the Thai cuisine. Had dimsum , dumplings, fried rice and other few dishes which I do not remember exactly. But each dish had a unique taste which awakened some of the hidden senses inside of me. Dishes were cooked to perfection. Service was prompt. Would definitely return.", 4.0], ["Sometimes Sunday afternoon can bring up the tricky question", 4.0], ["where do we eat? Being new to namma Bengaluru a close relative suggested", 4.0], ["just drive down to Koramangala and decide after reaching there.  Turned out to be a good plan. Finally decided on this restaurant", 4.0], ["no regrets.  Sunday afternoon very crowded. Had to wait for sometime but worth it. We had chicken satay, dimsum platter, raw mango salad as starters and khao pahd chicken,  nasi goreng chicken, Thai mussaman curry, lamb and bamboo shoots with black bean sauce as the main course.  Big appetite one would say. But no there were four adults and two children. So it was a little more than enough.  Food was very well prepared and staff was very courteous.  Will certainly visit again to try something different.", 4.0], ["I came to Bangalore from Delhi for a bakery course and someone There recommended this place to me as I was craving for some real good Chinese food and the place did not disappoint me at all  We ordered soup, appetizers and some main course for takeaway  I ordered hot n sour which had well balanced flavours and was up to the mark  In starters we ordered apricot glazed cauliflower which so crisp with right amount of sauce over it and spicy soya dimsums and spring rolls which were again tasteful and succeeded to satisfy my taste buds  For main course we had green Thai curry vd rice and chili garlic noodles  Overall everything was pretty good in taste and fairly priced  The ambience is good too but was crowded a bit cos of which the service was a bit slow even though when we had a table reservation done in advance  But still if you are served good food at the end you neglect the small things  👍", 4.0], ["Oh I just loved this place all over again. Visited here as a part of the Dinnerfest lunch and boy it was a treat!  The restaurant was ready with our table when we arrived and the service was swift.  We started off with Tim Tai chilly chicken and the pan grilled fish. The chilly chicken was out of this world, crunchy on the outside and juicy succelent on the inside. Crunchy peanuts and red chilly made it lip smacking.The pan grilled fish was equally good, flavoured with lemon grass cooked to perfection. We were stuffed!!  For main course we could not order one each@ as the starters had got us full, however we sampled Tim tai special chilli corriander noodles with Kung pao chicken. Both were extremely well prepared with generous portions.", 4.5], ["Oh I just loved this place all over again. Visited here as a part of the Dinnerfest lunch and boy it was a treat!  The restaurant was ready with our table when we arrived and the service was swift.  We started off with Tim Tai chilly chicken and the pan grilled fish. The chilly chicken was out of this world, crunchy on the outside and juicy succelent on the inside. Crunchy peanuts and red chilly made it lip smacking.The pan grilled fish was equally good, flavoured with lemon grass cooked to perfection. We were stuffed!!  For main course we could not order one each@ as the starters had got us full, however we sampled Tim tai special chilli corriander noodles with Kung pao chicken. Both were extremely well prepared with generous portions.", 4.5], ["Tim Tia is an Asian Fusion place in Koramangala and based on its Zomato ratings, our dining experience total matched our expectations. We started with a Non-Veg Dimsum Platter with a Raspberry Iced Tea. The dimsum platter came with 4 chicken, 2 lamb, and 2 prawn dimsums", 4.0], ["out of which the lamb and shanghai chicken dimsums were the best. Our entrees Roasted Chilli and Basil Fish along with Indonesian Bamee Goreng Noodles. To our surprise, instead of a stir fried, it was a actually a crispy fried fillets stirred with vegetables in a chilli and basil sauce", 4.5], ["giving it a nice crispy, spicy flavour. The noodles had typical a indonesian flavour of sambal.  On small note to the restaurant management, the restrooms were extremely dirty and water was all over the floor. This can be a huge turn off.", 4.0], ["So I thought real hard to try and find out faults with the lunch I had over here. Aaaaand I just couldn't come up with anything! Why not the perfect score ? Cause I feel there's always scope for improvement. Also cause the spinach gau dimsums weren't as impressive as the rest of the dishes severed. (Not that it was bad in anyway) So yeah the price may be a little on the higher side but its worth every penny. So stop scrolling through the rest of the reviews and reserve a table (highly recommended).", 4.5], ["A little detour from the D-Hide cafe and the stimulating grandeur of Tim Tai Deli bent our mind towards visiting it last Tuesday.It's prominently located in 5th Block,Koramangla and is simple to spot.Enter and you find 4 different kind of setups (table-chair combinations) at your service.Decide where to sit suiting your mood.They have front/back outdoor and indoor seating.Good job on the interiors.The interior and exterior design is well-planned,co-ordinated,researched and beautifully executed.Unquestionably adore the interiors.Period.  Coming to the food,I am not the biggest fan of Pan-Asian cuisine.Please keep that in mind. Malaysian Rendang(Curry and rice) : Notable coconut taste taste,slightly on the chillier side but again,still not very.  Indonesian Bamee Goreng(Noodles) : Average  Tim's no.1 Spitzer", 4.5], ["Out of this world ! Prepared with peach,tomato and ginger.Sweet,salty and chilly powdery.I vouch for this drink. Tim Tai has received rave reviews and although,i found the main-course average,i would like to revisit it in order to try out other dishes from the plethora of options available on their menu.", 4.5], ["A little detour from the D-Hide cafe and the stimulating grandeur of Tim Tai Deli bent our mind towards visiting it last Tuesday.It's prominently located in 5th Block,Koramangla and is simple to spot.Enter and you find 4 different kind of setups (table-chair combinations) at your service.Decide where to sit suiting your mood.They have front/back outdoor and indoor seating.Good job on the interiors.The interior and exterior design is well-planned,co-ordinated,researched and beautifully executed.Unquestionably adore the interiors.Period.  Coming to the food,I am not the biggest fan of Pan-Asian cuisine.Please keep that in mind. Malaysian Rendang(Curry and rice) : Notable coconut taste taste,slightly on the chillier side but again,still not very.  Indonesian Bamee Goreng(Noodles) : Average  Tim's no.1 Spitzer", 4.5]], "58576": [["Every time when I go to Jayanagar,  I make up my mind to go here but looking at the crowd I always return.So this time we went around evening before they opened,  thinking we  will be the only jobless people,  well well apparently all people came thinking the same :P      I expected people to lose patience and fight with each other looking at the crowd (that's how we roll :P) but they are quite disciplined and makes the whole process  hassle free, the queue for dosa does require some level of patience.       Coming to food,  I love the chutney and the lemony flavour to it, idlis I have eaten better ones in veena stores!!  And dose was with with utmost perfection( your patience pays off)  and the amount of tuppa you certainly wouldn't mind dying out of cholesterol :P,  coffee the best after MTR (brownie points for the cups), kept the star dish for the end Kesari bath FTW!!  I loved the veena stores one,  but this was way better and they even Add pineapple to it which makes it even more amazing. The most amazing part more than Kesari bath was I just paid 75 bucks for all of it (you Ll medium fries in that cash) you can always get clean,  hygienic tasty food for less rate :P", 4.5], ["Every time when I go to Jayanagar,  I make up my mind to go here but looking at the crowd I always return.So this time we went around evening before they opened,  thinking we  will be the only jobless people,  well well apparently all people came thinking the same :P -\nVery nice place and always crowded in the morning time .... All items are very less price..U eat and fill tummy as much u can...only thing u have to wait in queue to get items...Taaza thindi is awesome place in Bangalore to have breakfast\n-\nI would definitely give them 5 on 5 because they are by far the best breakfast hub when it comes to South Indian food. All the time full crowded yet getting your food won't take much time, however, dosa counters do need some level of patience. We do regularly visit the Jayanagar outlet and ordering chow chow bath, idly vada and tea/bournvita is a must. Fluffy and soft idlis along with my personal favorite tangy lemony chutney", 4.0], ["something to definitely die for. Dosas are a bit oily though but simply love the taste and flavor.Neat and clean ambiance, hygienic food and above all, super pocket friendly. What more do you need for a great sumptuous breakfast? Highly recommended.\n-Pocketfriendly and very tasty and the price of 1990 u get all the dishes of menu below 25rs, has an award for most hygienic restaurant in Bangalore", 5.0], ["Been wanting to eat here for so long, finally made up my mind, packed my cycle and went. Wow, what an experience. Thought I'll catch them early and be the only one when they open, reached by 7.15 am, and there is a queue already!! Thought I'll have to fight it out to get my food, but no. Suddenly I see people behaving and standing in line patiently. There is a queue for everything, hence you get your food quicker than most darahinis even if it's super crowded. Once you pick up your food, want chutney, there is a separate counter. You love the vada and want one more, but see the queue for coupon and want to leave it... well there is a guy who is floating around and you can top up there. Different counters and queues for idli, dosa, coffee make it very organised. And clean. Very clean. Food wise, I like the chutney in Veena stores better, but loved the idli and vada. Just too good. But the best part, what TT is proving to us, is good, clean food doesn't need to be expensive. 1 plate idli vada and 1 coffee cost me 40 rupees. In this day and age, anywhere else it's not possible. Overall, big respect for Taaza Thindi. They deserve the 4.9 rating on Zomato completely.\n-Been wanting to eat here for so long, finally made up my mind, packed my cycle and went. Wow, what an experience. Thought I'll catch them early and be the only one when they open, reached by 7.15 am, and there is a queue already!! Thought I'll have to fight it out to get my food, but no. Suddenly I see people behaving and standing in line patiently. There is a queue for everything, hence you get your food quicker than most darahinis even if it's super crowded. Once you pick up your food, want chutney, there is a separate counter. You love the vada and want one more, but see the queue for coupon and want to leave it... well there is a guy who is floating around and you can top up there. Different counters and queues for idli, dosa, coffee make it very organised. And clean. Very clean. Food wise, I like the chutney in Veena stores better, but loved the idli and vada. Just too good. But the best part, what TT is proving to us, is good, clean food doesn't need to...-No need to use ur grey cells of brain to figure out why dis place is jam packed... It was my first time over here the first thing that stoods out is the crowd and probably one myt thing it will take a long time to get the food.... But it is so damn good organized the entire process its just mind blowing it just took me 2mins to get the food.... Also u can see the process how they are making the food and the cleaning as well in a proper sterilizer that u myt wonder dat are u in a 3 star restaurant..... Oh did I forget to tell the pricing just 20 for dosa and 10 for an idli.... Also luckily I got a coupon 4 a free coffee as well... Tastewise I wud say its the second best dosa I have had in bangalore..... Also the idli were damn soft and fluffy.... Go dere to believe it guys\n-I guess the best place to find yourself the meal. Its cheap and too tasty. How would you react when you get a masala dosa just for rs 20 and its finger licking good. The quality served is too good. Loved the place in whole!!\n-On a Monday morning around 8:30AM , this place was slightly crowded where they had queue system for both placing order and collecting food. Tried their Masala Dosa for 20 bucks and it was decent.One of those rest. where you can't really complain much because they ain't charging you a lot and entire menu of rest. is within 150 bucks .Food", 4.5], ["3.5/5Ambience", 4.5], ["4/5Service", 4.5], ["4/5Value for Money", 4.5], ["5/5\n-Very good place for some quick ,south indian delicacy like Kharabath( upgraded upma) chow chow bath ( duo ,kesari bath and kharabath duet) and Masala dosa yumm.... and u will get some nice hot filter coffee and tea...only these things  available over there with reasonable price and quick supply of them.It will be open from 9 to 12 pm and from 4 to 8 pm .Its located next to cake wala ,ssmrv college.Must visit once;)\n-The food is not bad. The food is no great shakes. Yes, the masala Dosa is good. But, it is not as delicious as the reviews make it out to be. The coffee is good.The crowd here after 7.15-7.30 is horrendous! A minimum waiting time for 20minutes in queue for food! So, yes, do try this place out to know what the hype is all about and move on in life. Be sure to get here by 7!\n-I had heard a lot about this place and the ratings, well, 4.9/5 on Zomato. It ought to be extra-ordinary. I thought the place was nice and they serve really good Dosas, Idlis and Vadas. Even though there is a queue here, you'd get your order pretty much quickly. The prices are so less that with 100 bucks, you'd be able to fill your stomach quite easily. The chutney was amazing, I mean, it was one of the bests I have ever had. This place doesn't have extra ordinary food, but the prices and its simple yet effective food, makes it a must visit place in Bangalore.\n-I could identify this place by the huge crowd waiting in line for food. The menu is very limited. The quantity of food is much lesser than what you would expect... But it is priced accordingly. The masala dosa is too good and a must try. The vada was pretty average. Service was extremely fast. Staff was courteous.Tip: If you want to skip the crowded payment counter, there is a guy inside the restaurant who can give you coupons.\n-A very good place to have regular south Indian delicacy like idli, vada, filter coffee.Tried idli vada, kharabhat, kesarbhat and filter coffee. Ambiance: Very crowded place you need to stand in queue for your order.Taste: Very good taste and very simple in flavours.Service: Very quick for idli and vada but for dosa you need to wait for at least 20 mins.Value for money: 9/10.-Great place for tasty breakfast. Very very very reasonable price for food not sure how they make money at this pricing but masala dosa for 20 seriously !!.. and food is really very tasty. In weekend queue is big Sonu might have to wait for 10 min approx but it's worthy ...\n-Everything is well prepared and of remarkable tasty. They are popular for south Indian breakfast food. They have a very limited menu but all are deliciously made. I liked the idly, its so soft like it will melt on your moth no need to chew. And the best part is they have unbeatable price rate.Recommended to all my friends coz once I tried the food there and now I have become a fan of this place.", 5.0], ["Visited this place after looking at its rating on Zomato. The place was thronged by hundreds of people when we reached there. They define the actually fast food, I've never seen service so fast in my life. Yes and their main advantage the cost of the food, but i wasn't impressed as it was a business strategy( 5/5 for the business strategy though). The quantity was half compared to other food joints hence the price cut as well which people fail to see. Their Masala Dosa (4.5/5) was very crispy and yeah it was small making peopleopt for one more. The chutney blends well. & Coming to Idli Vada (4/5). they were tiny as i described earlier but yeah felt it was worth it. Khara bath(4/5) Liked it but quantity was very very less and Kesari Bath(4/5) I felt it was yum but my friend who accompanied hated it for some reason. The joint is kept very clean and tidy and sevice is & excellent as is said. Seating for & a few is available but people prefer standing.Overall a nice experience and yeah would love to visit again.Ambiance: 3/5Food: 4.5/5Staff: 5/5Value for money: 4/5\n-Visited this place after looking at its rating on Zomato. The place was thronged by hundreds of people when we reached there. They define the actually fast food, I've never seen service so fast in my life. Yes and their main advantage the cost of the food, but i wasn't impressed as it was a business strategy( 5/5 for the business strategy though). The quantity was half compared to other food joints hence the price cut as well which people fail to see. Their Masala Dosa (4.5/5) was very crispy and yeah it was small making peopleopt for one more. The chutney blends well. & Coming to Idli Vada (4/5). they were tiny as i described earlier but yeah felt it was worth it. Khara bath(4/5) Liked it but quantity was very very less and Kesari Bath(4/5) I felt it was yum but my friend who accompanied hated it for some reason. The joint is kept very clean and tidy and sevice is & excellent as is said. Seating for & a few is available but people prefer standing.Overall a nice...        -The rating given is quite obvious. Visit it once and you will know why? Small place with no seating area. Just meant for a quick breakfast or evening snacks. The place gets very crowded unless you are early. You would either have to eat standing or find a make-do seating outside the restaurant. We had both Masala Dosa and Idly-Wada here. Cost the three of us under 200 bucks. When it comes to the food, you will have no reasons to complain. These are among the best that you would find in Bangalore. Go for Masala Dosa if you want a preferred choice. They give a great deal of importance to Hygiene. So, please don't worry about the quality. Recommend it always.\n-Nothing to beat the taste, cleanliness, and value of this place. I love the idlis, vadas and the chutney here. The coffee is pretty good too, most of the times, manage to drink 2", 5.0], ["3 of them. Anyone in Bangalore must make it a point to visit this place at least one time!\n-Living in Malleshwaram, my expectation from South Indian food is higher solely because of the high standards set by the likes of veena stores, CTR, Hotel Janta and Raghavendra Stores. However the food at taaza thindi does indeed give good competition to these old establishments. The idlis are super soft and the masala dosa is super yummy. The Khara bath is quite different but super tasty and the coffee is great. Definitely a must visit for everyone. The super low prices and hygienic ambience is a plus over the delicious food.\n-I always wanted to eat here n today was that day ,the weather was perfect to have a plate of hot vada n to sip on a piping hot cup of coffee ,this place lives up to its reputation the food is amazing although they have a very limited menu ,what they have to offer is by far the best Indian breakfast that I have had ,the place is super clean ,management is amazing , only thing they could improve on is to go easy on the oil on the dosa but apart from that the food was amazing\n-Wat can u say abt this place... Just one word \"awesome\"They have raised the bar in hotel industry, hats off to their cleanliness and customer service. And the price ,    my god such a less price and the quality they give us amazing... Good work frm u guys keep going ... Wanna see more branches of urs in other areas ...\n-A Saturday morning stroll on this road after logging out of office introduced Me to this staple place.I came across a horde at 7am. Intrigued by this, I checked what was the deal about and I found a place serving piping hot South Indian staples.Eager to try the food here, I called a few friends and in a few mins We were all there gorging on delicious food.Their menu is limited, but all the items are yummy and worth a try.Hygiene, Taste, Quality &amp; Price... which We all look forward in an eatery are all taken care of an that seems to be their USP.This place is never to be missed. Strikes a chord with people of all age groups.The staff are friendly.Hygiene is a major draw for Me at this place.-Rated 4.9 on zomato, I was super keen on trying this place and I am glad I did. Nothing like the places I usually visit, this place is a LITTLE more than a street side idli-dosa stall", 4.5], ["one of many you find in Bangalore. What sets this place apart is the level of cleanliness and hygiene, which is totally praise-worthy. The place has a very limited menu", 5.0], ["plain and masala dosa, idle, vada, filter coffee is what I tried. I was immensely impressed by the dosa. It was fresh, filling and quite tasty. A point to note for all North Indians like me", 4.0], ["Food is not served with SAMBHAR, only coconut chutney. I was honestly quite surprised by the price of each item", 4.5], ["INR 20 for a Masala Dosa, that's very cheap for the quality they ensure. Finally, if you visit this place, be ready to stand in a queue and to eat standing up.\n-Very Good place for Breakfast or evening snacks.Not too many choices. The food is very decent with reasonable price. The Masala Dosa was the tastiest.\n-This place is like the role model for industrial revolution of restaurants... Everything is process driven to achieve perfection.. The prices are really pocket friendly and they have a limited menu... Was here for breakfast on a Saturday morning around 8 45 and this place was already crowded with a line for taking tokens... &Tried the idly and vada .. very well prepared and perfect on how it suppose to taste...Next was the chow chow bath, The holy combination of kesari bath and khara bath, tasted great as well.. As an icing on the cake you get half coffee free for khara bath and this costs you just 25 bucks.Last was the masala dosa, at 20 bucks you get hygienically well prepared  &dosa which tastes great...Wish I stayed this side of town to come here often :)\n-Finally made it to this popular no-frills joint! Only idlis and vadas were available (since we were there at 11:45) and both were excellent. Both came dunked in yummy homestyle chutney 😋 Great coffee too. Super clean place and we got space to sit on the benches and enjoy our meal.\n-Visited this place on Thursday, at 9.00am with a friend who has visited this place before. I guess i was 15th person in the queue and my friend told \" oh ! Its less crowded today !\".This should give you an idea about the waiting.Hats off to the people who has patience to take pictures of their food and upload here.I just stuffed it as soon as i got it!Here menu is limited and price is less when you consider the tasty food. Commensurately the quantity is less.I ate 3 idli, 2 vada, 1 masala dosa and had 1 Tea!Dosa was oily but tasty.Idli and Vada were great.Even I tasted Karabhat it was good and different.If you are not staying nearby then both traffic and crowd in the hotel will test your patience. Better visit once and decide.", 4.5], ["Been here a few times for breakfast to satisfy my dosa cravings. This joint runs purely on the basis of the quality of food served. Every inch of the space available is occupied due to the inevitable rush throughout the week. You need to wait in long queues to get your order but the service is efficient. Have tried their idly, vada and dosas (plain/masala). The clear favourite among 90% of the mass is definitely the masala dosa. Being aware of that, they have it ready in bulk for fast service (freshly prepared). The dosas are quite oily due to the excess ghee but I assure you it's a healthy choice if consumed early in the day. 😉 The other items on the menu are quite decent as well. They serve limited chutney on the plate but the customers can return for an additional serving from their chutney counter. The point being, they don't encourage wasting food. Almost forgot to mention the steaming hot coffee which ensures a great start to the day. Pricing is super reasonable ranging from 10-20 bucks per item. Also, they don't have a delivery or takeaway option. So if you want to avoid the large crowd and enjoy eating at home, you need to carry your own receptacles to parcel the food! I am assuming they don't support the use of plastic bags as well 😬 Overall, a must visit! 🙂\n-Been here a few times for breakfast to satisfy my dosa cravings. This joint runs purely on the basis of the quality of food served. Every inch of the space available is occupied due to the inevitable rush throughout the week. You need to wait in long queues to get your order but the service is efficient.", 5.0], ["Great value for less money. An amazing breakfast place hidden in the streets of Jayanagar. It is a very neat and clean restaurant with only few items in their menu. They have kept it less but did no compromise with the quality. A huge crowd turns up there every morning, still they manage the consistency in taste and quality. I decided to go there after seeing their rating on Zomato; it's the highest rated restaurant.The ambience is not something you need to worry about here. It's a small place but you will surely get place to sit after some wait probably.The food is quite amazing. We ordered Idli Vada and their famous cuisine Masala dosa. Masala dosa was the best, crisp and tasty. Idli was also very soft. However, they don't serve Sambhar but only Chutni.Service is the best thing there. They are real quick and in minutes you will get your food. They have separate counters for Dosa, Idli-Vada and Coffee/Tea which makes it easier for the crowd to receive their order, quicker also at the same time.Lastly and most importantly, it's very cheap. Even in 50 bucks, you can eat stomach full.This one is definitely challenging the Classic South-indian breakfast places of Bengaluru. However, I feel it's time for them to add new items to their menu now.-Great value for less money. An amazing breakfast place hidden in the streets of Jayanagar. It is a very neat and clean restaurant with only few items in their menu. They have kept it less but did no compromise with the quality. A huge crowd turns up there every morning, still they manage the consistency in taste and quality. I decided to go there after seeing their rating on Zomato; it's the highest rated restaurant.The ambience is not something you need to worry about here. It's a small place but you will surely get place to sit after some wait probably.The food is quite amazing. We ordered Idli Vada and their famous cuisine Masala dosa. Masala dosa was the best, crisp and tasty. Idli was also very soft. However, they don't serve Sambhar but only Chutni.Service is the best thing there. They are real quick and in minutes you will get your food. They have separate counters for Dosa, Idli-Vada and Coffee/Tea which makes it easier for the crowd to receive...\n-When you head to this restaurant on a weekend morning, be prepared to be greeted by long queues and no seating. This is yet another QSR with minimalist ambience and cheap yet hygienic South Indian breakfast. For the locals who're used to Veena stores and CTR in Malleshwaram, this restaurant wouldn't be any different but for a non local who discovered this place solely through zomato's high rating", 5.0], ["it would be a bit of a shocker. If big crowds and standing road side in a cramped space to eat isn't your thing; please ignore this restaurant.The menu is simple and the prices do tend to shock you. No dish is priced more than 20 bucks. Must try: Masala Dosa. Let me fore warn you, no sambar is served here :) Also do try the Coffee.Meal for two: Maximum 100 bucks Note: There's no car parking anywhere close to the restaurant and you'd have to spend at least 15 minutes going around the neighborhood hunting for a free spot, on weekends. Don't think weekdays would be any different.\n-Amazing, amazing and just amazing. What a price, quality,  quantity they are giving. No one can beat their taste and maintenance. Must visit. Limited menu with unlimited taste.\n-I had come here once. I don't get the hype. Yes, food is good but it's not excellent and the fact that I have to wait 20 mins for my food and eat it standing at the roadside doesn't make sense. It's very inexpensive but then again it doesn't matter. You need to have at least two of the following.1. Great food2. Long Waiting 3. Place to sit\n-One more place off my wish list. However I am sure I want to keep it in my list to visit here again and again.Service was pretty fast, and plates as well as spoons were properly cleaned.Heavy crowd says it all. The attendants are really efficient and polite.Now, coming to food, there idly was really fluffy and melts right in mouth. Vada was very tasty, without too much oil. Masala dose were really crisp as well as thick, eating those with their chutney were soo good that we packed some for later.Just removed 0.5 points for much oil in Masala dose.It would never stop us from going here again and again.\n-Taaza as the name says it's always fresh and pure. One of the best place for South Indian food. The dosa rate has never hiked since it has been opened. Who gives a dosa for 20 bucks!?  These people here do and it is one of the finest cooked with the high end material. Idli for one will cost u 10 bucks. Coffee or tea is 10 again.. Coffee is just the perfect filter coffee and they don't compromise on the quanity though they giving it for 10.Kersaaaaari bath on of  the finest I have ever had. One thing I love about this place is the hygiene and the team work.. They never compromise on anything.. Just a perfect place.. I will be going again and aging and again till I die.\n-Holy Grail.When it comes to value-for-money breakfast experience, there is no beating this place. Its mesmerizing. It is a traditional Bangalore breakfast place with a modern twist. Their processes are very well organized to manage the crowd of such scale. They@ have exactly 13 items on the menu including extra butter and extra palya. There is no table chair seating, they have verandas and stand-n-eat platforms. Having been to CTR and other breakfast places, I can vouch for their service It is unlike what you ewould expect. The food is good. Masala Dosa is their highest selling item and rightly so. The dosa at Sri Guru Kotteshwara Benne Dosa is definitely better, but that place doesn't match the experience that this place provides. Tried the masala dosa, vada and badam milk at a total expense of Rs.50. Value for money at its best.Overall, its a  must visit, a temple for food lovers.Ambience: 5/5Service &amp; Staff: 5/5Food: 5/5Value for Money: 5/5", 4.5], ["Well, doing great dishes out of innovation is one thing, although making simple things in a great way is no less.One of the best places for masala dosa and idly in town.Been here at least ten times, and I'd strongly recommend this restaurant to anyone and everyone!Must try : Masala dosa (adding butter is optional)IdlyVadaHave tried kesaribath, it's good too, the only thing which was not up to the mark was kharabath.-Well, doing great dishes out of innovation is one thing, although making simple things in a great way is no less.One of the best places for masala dosa and idly in town.Been here at least ten times, and I'd strongly recommend this restaurant to anyone and everyone!Must try : Masala dosa (adding butter is optional)IdlyVadaHave tried kesaribath, it's good too, the only thing which was not up to the mark was kharabath.-5 isnt enough for this place, just not. I went there on a saturday morning and was disappointed first looking at the crowd. But exactly after 2 minutes I was out of the long queue with my idli, kharabath and also dosa. They have this amazing speed and order all in perfect place. The chutney here is too good, that no sambhar here is not even a bother. Their hygiene is also undoubted and perfect. The costs are very very minimal, all around 20 rs. I just loved this place!!\n-Don't call yourself a foodie if you haven't been here! The best masala dosa the best idlis and vadas. Mouth watering! And everything at the cheapest rate you cannot even think of :) Their cleanliness and maintenance is just next level. The importance they give to hygiene is much appreciated. As I write the review, the first thing m gonna do tomo morning is have idli vada here :p\n-This place is good for a quick breakfast and a good one too and if you got a limited budget no problem.  Eat tasty masala dosa and coffee and rush to work or better you can parcel it too.\n-Have just 20 bucks in your wallet? You think you can't go to a decent hotel? That's enough to visit this place. The quality of food is nothing less than any darshini in Bangalore. The masala dosa is coated with a spoon of ghee and chutney. The idli-vada combo is too good and the chow-chow bath also tastes really good. I love the fact that you can buy extra butter to eat with your dosa and this makes your experience so much more better. All the items on the menu costs 10 or 20 rupees and they haven't hiked the price since it's inception. I also love the fact that no matter what happens, the customers form a queue to collect their order. The hotel serves only chutney and no sambar. The place is a mad house on weekends and on holidays. But the quality of food is worth the wait. Must go.", 5.0], ["Delicious and hygienic place for a south Indian meal ! They invested in these 2 (ignoring other aspects) and folks come here expecting a super experience on these two only. We tried Plain Dose, Masala Dose, Idli and Vada. Vada was hot and crisp", 3.0], ["find this a rarity in most places. Idli melted easily in mouth. Dose seemed to have a special batter. They are thicker and crispier. Served with chutney only, sambhar lovers would be disappointed a bit. But then we didn't go there expecting sambhar", 4.0], ["we wanted to experience what this place is known for.Couldn't help trying other delicacies (they have a small menu and they do full justice to each item)", 4.5], ["chow-chow bath, kharabath and coffee. All were yummy.Special mention on hygiene", 4.5], ["they use organic dish washing liquid and international dish washing equipment (can be seen by any visitor) and infra red equipment for disinfection of spoons.The place has limited seating and standing space. Designed deliberately I think so that people feel the high demand (most people will have to stand and eat). They manage the crowd well through the queue system and the staff was found to be friendly in spite of so much crowd to be managed.Finally, the prices are so reasonable that one wonders if they make a loss on per unit! Good for us and for them as they make money on volumes.\n-Delicious and hygienic place for a south Indian meal ! They invested in these 2 (ignoring other aspects) and folks come here expecting a super experience on these two only. We tried Plain Dose, Masala Dose, Idli and Vada. Vada was hot and crisp", 4.5], ["find this a rarity in most places. Idli melted easily in mouth. Dose seemed to have a special batter. They are thicker and crispier. Served with chutney only, sambhar lovers would be disappointed a bit. But then we didn't go there expecting sambhar", 5.0], ["we wanted to experience what this place is known for.Couldn't help trying other delicacies (they have a small menu and they do full justice to each item)", 4.5], ["chow-chow bath, kharabath and coffee. All were yummy.Special mention on hygiene", 4.5], ["they use organic dish washing liquid and international dish washing equipment (can be seen by any visitor) and infra red equipment for disinfection of spoons.The place has limited seating and standing space. Designed deliberately I...\n-To have the best masala dosa in town you better visit this place. The food here is mouth watering, especially the dosa. The dosa, idli", 5.0], ["vada and everything else is very consistent in taste. Everything is made to perfection in this amazing place. The food is also super cheap considering the Hygiene and quality they follow. The only drawback, its overcrowded all the time.\n-One of the best south indian eatouts in Jayanagar. Known for their cleanliness and quality of food.It is not a fine-dine place where you can eat aaram se. But the quality of food is worth it. There is a lot of family crowd here. This is a really good place for parcel food.", 5.0]], "52098": [["Place is inside the locality main road, and there is no parking space at all.... , taste was good, pocket friendly, good place to go after a long walk in gandhi bazaar", 3.5], ["One the best chutney and idly is so soft that it will just melt in ur mouth..crispy Uddina vada and tasty khaara bath..Awesome coffee..It is my regular place for a quick snack in the evening..", 4.5], ["I've been here a few times. The vadas are pretty good. I absolutely love the kesari bath here since they also add Vermicelli in it, Which really compliments the taste.", 4.0], ["Some of the best idli-vada you'll eat in your life. The filter coffee is amazing and makes me proud to be a South Indian. Unlimited chutney refills. Take that, Taco Bell.", 5.0], ["Ideal place for an early morning idli. The idlis are soaked in liquid chutney unlike conventional sambar. The outlet opens exactly at 6am and serves hot idlis and vadas  that is worth waking up early.", 3.5], ["Getting to Bangalore early by train means that you can reach before the opening time of Brahmins. It's a legendary place that still serves the epic Idli vada that I've loved and their awesome chutney.", 4.5], ["You want to know what is the bestest and tastiest idli?? Well, this is the place which will give your mouth a feeling of craving more and more. Nice and clean place. Self service. Tables are arranged outside to keep your plates. Best part is idli which is soft and delicious and once you place it in your mouth, it melts. Coconut chutney is very mouth watering. You can get it unlimited since there is one man who sits along with big pot only with the chutney. :)Don't miss it", 4.5], ["do visit. You will not regret for sure.", 3.5], ["Extremely over hyped. Maybe there is some nostalgic value in this place but as a south Indian breakfast outlet it is no way comparable to Taza Thindi in jayanagar.Be it food taste, ambience or price, Taza Thindi is better in every regard.", 4.0], ["I love this place, they say \"you're not a true banglorian, if you haven't had idly\" not only idly,,, coffee is also the best... Sometimes U have to Chuck ambience to enjoy the tastiest food. Cheers.", 4.5], ["Was travelling via Basavanagudi early morning so had to try at this place and it dint dissapoint me at all.    Vada and chutney was crispy and spicy, the way i like it and coffee too was good. Must try this place if you are near by.", 5.0], ["Heard about this place alot when i went to bangalore. I was really looking forward to visit this place and try the legendary soft idli and crispy vada i heard about.The place small in size and most of the time it is filled with people,you might having your food outside the cafe on table standing.", 4.5], ["Serves the best Idlis in this side of Bangalore. Legendary i would add. I feel the prices are a bit high compared to other idli outlets of the same calibre in Bangalore. Yet its a must visit. Its crowded heavily so dont expect to have a peaceful meal if u are here.Ambiance: No SeatingFood: 4.5/5", 4.5], ["Classic is the word u can say abt this place ... It's old school it's old Bangalore just the way we loved it back then ... Look at their name board it's not flashy it's not some neon lights it's a classic painted board with the same old 90s fonts 😍. Food here is awesome I mean they hav a very limited menu but that's the way they maintain quality and serve their customers soo well ... No words to say abt idlys it's totally awesome... And coffee 😘😘😘😘 daaaaaaaaamn gooood... Awesome place ppl ...", 4.5], ["Here is where you find the best Idly vada sambar in town. A must visit for breakfast not only pocket friendly but heavenly and filling foodFood: 5", 4.5], ["Well..after such a long time pending finally went to this place for breakfast..heard they served one of the finest idli vada and coffee..Well all are true, the idli vada and nariyal chatni are one the best you get in Bangalore.. if you are a south Indian cuisine lover you simply will find this food heavenly..", 5.0], ["One of the finest destinations for the quintessential Bangalore breakfast.I've been to this place 6-7 times now and each time I went, I knew I'd be coming back for more.", 5.0], ["One of the finest destinations for the quintessential Bangalore breakfast.I've been to this place 6-7 times now and each time I went, I knew I'd be coming back for more.", 5.0], ["The place smells history. Simple minimalistic food. Cheap prices. Quality food. Clean place. Nothing to give less than 5. Idly, Vada, Kesar bath, UPMA", 4.5], ["everything is amazingly tasty. Best place in Bangalore for early morning breakfast. Cheers!", 5.0], ["This is legendary place for idlis and uddin vada . This is one of those must eat breakfast joints in bengaluru . The place is always crowded with hardly any place to stand and it's just 4 items on the menu , idli , vada , khara bath and kesri bath ...with amazing green chutney u will keep going back for more ...over all an amazing place u must try ....cheers", 4.0], ["It's said well begun is half done.... A great breakfast will mark the course of your day. One of best places to have filter coffee. Piping hot idli, crispy case with a great blend of chutney sure fills you up with energy. Kesari bath makes you getting up worthwhile. This cafe has selected items on menu, it's clean, no seating but good provision to stand and eat.", 5.0], ["Worth driving all the way to relish on some hot and soft idly and crispy delicious vada with some spicy coriander chutney. Brahmin's coffee bar is definitely a must visit and must try the coffee. Kesari bath is also nice. Cheers. :)", 5.0], ["Brahmin's coffee Bar, a legendary place which doesn't compromise on quality. Easily the best idli", 5.0], ["vada in town, the idlis are very soft and they just melt in your mouth.The vada was served hot and wasn't oily, just the way I like it. Their chutney is spicy and unique. Their kesaribath is just too good to be missed out, but just watch out for the oil(ghee) in it.The kesaribath also had shevige in it, which is something I liked. Coming to the coffee, Just tasted the way actual filter coffee tastes back home. As we cultivate coffee in coorg, I know exactly how the authentic filter coffee tastes like.", 4.5], ["No place can ever compete with this place. The aroma of the chutney drags the customers in. The combinations of crisp vadas and soft idlis with spicy chutney is just lipsmacking. The coffee in the end of a filling meal is so good that you can literally forget everything and just sit here and get lost in that cup of coffee on a rainy day.Keep it up!", 5.0], ["Brahmin's coffee bar undoubtedly serves some of the south Indian dishes in Bangalore. From mouthwatering idlies to crispy vada nothing is taken for granted here. Everything stands out with its own character of taste. The idlies literally just melt in your mouth and you can hear the crisp as you break and chow down those amazing vadas. Khara bath has the texture of butter (so smooth). Filter coffee is a must try here. You get extra chutney from a different counter.This place has been here since ages and has maintained the quality in terms of food and discipline that goes into the making. That is the reason the place gets flooded with hungry people within minutes after opening the doors. Cleanliness and hygiene is of the highest priority here. I would definitely recommend this place as a must try for all foodies.", 4.5], ["One of the legendary hotels in Bangalore know for their best Idly and Vada along with the irresistible mouth watering chutney. No place in Bangalore can beat their Soft and tasty idly, even their vada's are so crisp and fried to perfect golden brown that you cannot resist when you see them. Their chutney is so tasty that you can literally drink it with no hiccup.", 4.0], ["Who doesn't love idli vade and authentic filter coffee on a cold rainy day? This place opened ages ago and still people go there to eat yummy food which hasn't changed it's menu as well as the taste.If you are a Bangalorean and if you don't visit this place then you are missing something which is worth.", 4.5], ["Walked into Brahmin Coffee Bar with sky high expectations ( I mean the Zomato community thinks its a 4.9 ) and walked out feeling very content. An unassuming place with no real seating or ambience to speak of, Brahmin Coffee Bar does its limited menu phenomenally well. The idlys are soft and melt in your mouth ( pay the Rs. 8 and get the butter on them ) and so is the staple Khara Bath. The highlight however is the coffee, Im not a coffee drinker and I had to rely on my breakfast company for this part of my review, but in his words \"easily the best in  Bangalore\".", 5.0], ["A small place with a very simple menu, serving amazing idli vada with only chatni. The price is very less and totally worth the taste! The refreshing coffee at the end, makes the perfect breakfast.", 5.0]], "51065": [["You genuinely feel gratitude towards the founders of a food space the moment you realize they carry the same puritan beliefs you do. This was a sum up of my experience at vidyarthi bhavan. The line outside no thanks to Karnataka rajya Otsava was huge. Took us 40 mins to get a place. The food however more than compensated. The masala dose has a mild south Indian aalo mix with a really thick almost bread like dose made in pure butter. The flavor the comes from blending out of the world ingredients is just insane. The upma was so good that a non upma eater like me polished the entire plate. Special mention for their coconut chutney which is on the spicy side, but goes well with the food. Will definitely go here on those rare occasions that I crave South Indian veg food.", 4.5], ["Vidyarthi Bhavan came into existence somewhere in the 1940s i.e., even before my parents were born! You can imagine how much historical value it has in terms of culinary achievements in this city.This place has had very little changes in terms of the way it looks. They have tried to retain it's old charm.We reached here exactly at 7am and the place was full already. There were people leaving the place after finishing their breakfast. And we had to wait for a good 20 minutes before we got seats for ourselves. You cannot expect a table to yourself and your partner/ family. You have to share your table with a total stranger sometimes, like we had to.We wanted to taste everything this place had to offer but it was only 2 of us. So, we tried what this place is known for since it's inception the 'dosey'.The hot and crispy dosas had our mouths watering even before we ordered. We decided on ordering sagu dosey, masala dosa, vada, poori sagu and coffee. Another good 20 minutes before the dosey came. Chutney took another 3 minutes. Coffee didn't come at all, so we just ignored it. By this, you should know that you have to be really very patient. There are too many people and it might take quite some time for your orders to reach your table. The dosey is comparatively smaller in radius and if you want sambar, you need to ask for it. It's not given along with it by default, like in other South Indian Hotels. I'd say, If you're a Bangalorean and you haven't been here, it's time you do. If you're not from the city, then you should certainly visit here before you move elsewhere.", 3.5], ["Vidyarthi Bhavan came into existence somewhere in the 1940s i.e., even before my parents were born! You can imagine how much historical value it has in terms of culinary achievements in this city.This place has had very little changes in terms of the way it looks. They have tried to retain it's old charm.We reached here exactly at 7am and the place was full already. There were people leaving the place after finishing their breakfast. And we had to wait for a good 20 minutes before we got seats for ourselves. You cannot expect a table to yourself and your partner/ family. You have to share your table with a total stranger sometimes, like we had to.We wanted to taste everything this place had to offer but it was only 2 of us. So, we tried what this place is known for since it's inception", 3.5], ["the 'dosey'.The hot and crispy dosas had our mouths watering even before we ordered. We decided on ordering sagu dosey, masala dosa, vada, poori sagu and coffee. Another good...", 4.5], ["Iconic Bangalore place they say", 3.5], ["a very satisfying Diwali breakfast later, I have to fully agree! Was a half hour wait", 3.5], ["we whiled it away delightfully shopping for this and that in the puja/ flower/ fruit market around.They have a system", 4.5], ["the wait staff has walky talkies! All people in one party have to be seated one side of the room etc. But has an awesome ambience", 3.0], ["olde world but v charming .And the food!!! Ooh Lala! The khara baath", 4.0], ["was to die for! The idli vada sambar nice, and the masala dosa", 3.0], ["with red rice, full of ghee, but sooo yummy!! Finger licking good!", 3.0], ["This restaurant has a really old feel to it. The building has that unique charm. The inexpensive food served here is good and I loved the idly sambar. Many people consider the dosa served here to be the best but I felt that it was overated and didn't taste as good as the adiga's dosa. One time visit would do.", 3.0], ["The name it has made for itself made me want to give this a try though I am not a big fan of masala dosas. I wasn't disappointed as the piping hot dosas are both crisp and soft at the same time, with they yummy green chutney around it . The rava vada was something I tried for the first time and was left craving for more . The management is something that is really commendable, they have adapted to modern technology like using a walky", 3.5], ["talky to communicate the number of seats available ,the billing and service are quick too . There is a mandatory waiting period which cannot be determined, but it's worth it . The ambience is maintained to evoke nostalgia to native Bangaloreans", 4.5], ["Best dosa I have ever had in my entire life... It's been very long since I visited this place... Near to Gandhi bazar... And the way they serve the food toh wah...!! Mouth watering... Cheers!!", 4.5], ["Why 5, why 4.5, why even 3.5 ??We visited this place during weekends as we are heading towards Avalabetta. We heard that this is the place where you will find breakfast early in the morning. We thought to give it a try and went almost 15km opposite of Avalabetta journey. To my surprise I don't feel this place as good as they say about it as Legendary.  We waited for almost 20min for 4 masala dosa's to get served to us. The potato masala was overcooked and the batter for masala dosa is of Ragi and not Rice. We also ordered Kharabhat which was perfectly cooked. This is a very small place in the heart of basavanagudi and you will find it crowded between 6:30am till 10am.", 4.0], ["#dinusfoodexperience #Breakfast #Weekend #vintageplace#vidyarthibhavanGreat Start @ culinary histroy of Bengaluruthis morning by 6:30 AM.This palce often has long queues... but its worth the wait.Idli Sambar:", 4.0], ["5 years before I visited this place it was the best place for dosa idli wada #southindian breakfast , but today after long time I visited the place now I feel the place is over hyped the quality of taste is no more the taste of sambar has been maintained but it has been made more watery ,#masaladosa u can find the same taste in most of Bangalore local foodjoints , idliwada are also k not as it used to be , if u r looking for good taste u can opt for #taazathindi #slvbdabanashankari #brahmincafe", 4.0], ["Go there only if you are patient enough to wait, we waited for more than an hour just to get a table for two. We had heard a lot about this place, so thought of giving it a try. Once you are inside, you get this very traditional feeling and you kind of get a positive vibe. Their menu is also limited. So we ordered for masala dosa, kesari bath and filter coffee. They gave us the kesari bath first, I had a nice bright yellow colour to it. A bit wobbly, not too sweet, just perfect, I'm not a big fan of dry fruits, so I was happy with this one as it only had kismis in it. The masala dosa took some time to reach our table. They just serve the dosa first and then comes the chutney. One thing that we observed was that they don't serve sambar with dosa, i wonder why. The dosa was thick and crisp. To be honest, I didn't feel this was worth waiting for hours. The potato masala inside was cooked properly and wasn't hard. Talking about the filter coffee, I love coffee, specially filter coffee and I would like to say that I've had better filter coffee than this one. On the whole, it was a very different experience. I would like to give the-Food", 4.5], ["3/5Ambience", 5.0], ["3/5Service", 4.0], ["4/5", 4.5], ["Go there only if you are patient enough to wait, we waited for more than an hour just to get a table for two. We had heard a lot about this place, so thought of giving it a try. Once you are inside, you get this very traditional feeling and you kind of get a positive vibe. Their menu is also limited. So we ordered for masala dosa, kesari bath and filter coffee. They gave us the kesari bath first, I had a nice bright yellow colour to it. A bit wobbly, not too sweet, just perfect, I'm not a big fan of dry fruits, so I was happy with this one as it only had kismis in it. The masala dosa took some time to reach our table. They just serve the dosa first and then comes the chutney. One thing that we observed was that they don't serve sambar with dosa, i wonder why. The dosa was thick and crisp. To be honest, I didn't feel this was worth waiting for hours. The potato masala inside was cooked properly and wasn't hard. Talking about the filter coffee, I love coffee...", 5.0], ["I have been here couple of times. The idlies are nice, the masala dosa is ok. The sambhar was watery, not thick as I expected, and as other darshinis provide. Chutney is the only thing I can eat here. I am not sure if the management is the same or has changed, but I think their food standards are not upto the mark, so is the coffee.", 4.0], ["Tucked away in the crowded gandhibazar, this legendary place is sure to be visited if you are in bangalore. Yes, of course there will be huge waiting times and if you are lucky you will get a seat quickly. You may have to share your table with other people. Rava vada and masala dose are upon you. You attack them with all your strength, chutney will be poured onto your plate whenever you ask for it. You come out feeling happy, burping with joy.", 5.0], ["The perfect place to be for every dosa lover in Bangalore. These people have made a name for serving one of the best dosas in town. Must try their Masala dosa and Sagu masala dosa. Their Rava vada aint bad either. The servers are known for they do and they have been doing since a lot of years. this is place is crowded at anytime of the day when it is open, so get in as soon as it opens to avoid longer wait times.Ambiance: 3/5Food: 4.5/5Staff: 4/5Value for money: 4.5/5", 4.5], ["The place still has not been renovated and that adds the feel of old bangalore...awesome dosa ..crispy...and the coffee is too good...worth waiting", 4.5], ["Love this place for their dosas and coffee.The dosas just melts in your mouth and suddenly you feel like you have become a glutton and feel like gobbling up of dosas.their chutney too is very good.You'll have to wait more than 30 min for your benne dosa but you'll finish the dosas in 3 min!!! It's worth the wait and very pocket friendly. Best place to have breakfast or occasionally lunch as well.must visit place for their benne dosas.", 3.5], ["I hate myself for not visiting this small yet legendary dosa joint even though its been 3 years of living in Bangalore. So woke up early one fine Saturday morning travelled for 14 kms and landed up here. We had poori sago, masala dosa, Kesari bath, and coffee.Everything was good, a special mention to their thick yet crispy dosa and sweet kesari bath drenched in ghee. Loved it.", 4.0], ["Had been here on sunday morning for breakfast. We waited for around 30", 3.5], ["40mins to get a table, but it was worth the wait.  Had ordered masala dosa,  saagu masala dosa,  kesri bath,  poori sagu,  idly,  vada and tea.  They serve in traditional way,  wearing lungis with many plates in hand. Masala dosa is must try when you are here.", 3.5], ["VB is the place to be in when in B Gudi. After a waiting for a table for about 20 minutes, lopping dosas and stuff is so heavenly. Way to go VB", 3.5], ["I have lost count of the number of times I have visited this place. For all the Non resident Bangaloreans, VB as it's often referred to is a must visit whenever they are visiting the city. The ghee dripping Masala dosas, the sight of dollops of butter melting on the dosa and their signature style chutney threatening to fall off your plate..what an awesome photo memory it is! Must try is the chow chow bath, Maddur vada and of course Masala Dosa. If you are in the Gandhi Bazaar, Basavanagudi area, don't miss this placeIt's not a huge place so go there early if you want to sit and eatFood: 4service: 4ambience: 3", 3.0]], "57141": [["Ordered dal and paneer do pyaaza. No issues with service. Pricing is higher for curries, tastes good. Chana dal was properly cooked", 3.5], ["flavoursome. Paneer was soft, a bit oily", 4.5], ["thick gravy.", 4.0], ["Pure punjabi food! All north indians who crave north indian food, this is the place to hit! The dal makhani and the paneer will take you to an other place. CHEESE BURST PARATHAS, yes you read that right. Cheese lovers, this exists and you have to give it a try. The lassi was out of this world as well. The service was fast and the food was delicious.", 4.0], ["Nice place to have authentic punjabi food . I went to this resturent first time with lots of hope . The food was excellent taste . Ordered paratha , lassi , chass , thali . All the food taste was superb . The owner and staff are gentle and nice . They asked feedback for improvement of any dish they served . I recommend  friends to go and enjoy really tasty food .", 3.0], ["Visited the place on Diwali day, the place was very crowded but the staff was courteous enough to help us find a seat for two. I could see the staff running about to keep pretty much every one happy. We ordered the dry fruit lassi, masala chaas and parathas. The staff reminded us that the qty of parathas might be too much for us and suggested ordering half of want we ordered and order again if required. Very thoughtful of the staff as we were visiting the place for the first time. The food was very delicious especially the parathas which were served with a large dollop of ghee! Definetly recommended for authentic punjabi food!", 3.0], ["I feel this place is a bit overrated. I have been wanting to visit this place since some time after reading raves on Zomato, but the place did not live up to the hype. First of all, it is more of a dhaba (a little more elegant maybe) than a café. The place is located little inside the main road where you would not imagine it to be. It is an area where you might find a garage kind of a place, but it’s good that there is sufficient parking. The place has a rural touch. The Punjabi culture phrases on the walls make it very interesting; I especially enjoyed reading the ‘fun facts about punjabis’ more so because being a Punjabi I could relate to most of these. So ambience wise it is a decent Punjabi place to be in.But I was disappointed with the food which was way too spicy and oily than it should have been. I know Punjabi cuisine is known for its rich gravies and flavor, but this one was low on flavor and it was just too oily and a lot spicy taking it to the unhealthy side. The alloo jeera in my thali was undercooked and the butter paneer masala was just high on masalas. The green chutney was watery. Alloo parantha was a little better in that sense, with good and proper filling but I felt if you are serving one parantha in the range of Rs 50-100, it better come with curd at least or we should get an option of getting curd instead of butter.I have been to a lot better Punjabi restaurants in Bangalore serving authentic food and at lower prices than this one, but seems like there is a dearth of such places in this area which is why this one is thriving!", 4.0], ["I feel this place is a bit overrated. I have been wanting to visit this place since some time after reading raves on Zomato, but the place did not live up to the hype. First of all, it is more of a dhaba (a little more elegant maybe) than a café. The place is located little inside the main road where you would not imagine it to be. It is an area where you might find a garage kind of a place, but it’s good that there is sufficient parking. The place has a rural touch. The Punjabi culture phrases on the walls make it very interesting; I especially enjoyed reading the ‘fun facts about punjabis’ more so because being a Punjabi I could relate to most of these. So ambience wise it is a decent Punjabi place to be in.But I was disappointed with the food which was way too spicy and oily than it should have been. I know Punjabi cuisine is known for its rich gravies and flavor, but this one was low on flavor and it was just too oily and a lot spicy taking it to...", 4.5], ["This would be one of the closest to a dhaba all the way south in Bangalore. The mishti dahi was heavenly and so was the poori chole. The food is true value for money and the taste has an authentic feel to it. The seating is at best casual but the service and smiling staff make the place pleasant.", 4.0], ["Delicious Punjabi food. Loved the food, simple ambience, background old Punjabi pop songs and aloo de paranthe.It is definitely nice North Indian place in Bangalore.We ordered aloo parantha, gobi parantha, khasta parantha, all tasted so good. They serve it in Punjabi style with lots of butter :PBeing an ardent fan of Punjabi food we ordered kadhi pakoda and rice also. But it was a slight disappointment, can be improved.For desert we ordered fruit cream, it was too good and lassi was mindblowingly great.Overall it was a fun evening eating awesome food and listening to old Punjabi daler mahendi songs :)", 2.0], ["Ordered kadhai paneer and rotis from here. The paneer was awesome. Really spicy and hot. I have had this dish before in a different kapoor's cafe but this was way better. I will definitely be ordering from here again. One dish was barely enough for one eater.", 4.5], ["The place has nothing to flaunt for, no good food and worst ambience and infrastructure. And its overrated and highly priced. They should atleast improve the food quality.", 3.5], ["Perfect place to taste some good and spicy north Indian food. Ambience adds flavor to it. I feel it is little over priced but worth going if you are a fan Punjabi food. You will get good burps after having food here. Buttermilk and lassi are worth trying..really like the way they serve it in \"Kulhad\".", 5.0], ["Authentic Punjabi restaurant. it has come up with a new outlet which is great as this is always overcrowded. Must try  cheese pataka balls for starters.", 4.0], ["This is an awesome place to hang out. Foods are delicious and available in awesomely low prices.  Ambience is not too great but who cares when u get such food!! Lassi is must try here.", 5.0], ["At last was able to go to this place. A great punjabi restaurant . Best part is it is veg👍.. loved the food , the parathas were awesome just loved it. In case you are not a fan of butter , do let the waiters know that you donot want butter or else the parathas will drip in butter. Loved the lassi.. they have a nice system of paying the bill where you have to go to the cashier to pay, he will read the bill and you pay. I felt it gave it more of a human touch. the only thing that I thought could be better was the seating.", 4.0], ["Visited the place thrice and never got disappointed.Ambiance is not that great, but you will definitely fall in love with the food. Dhaba style with authentic punjabi taste. Highly overcrowded....Kheer must try!!!!", 3.5], ["Kapoor's Cafe It was a authentic Punjabi cuisine with local Desi infrastructure. Didn't expect the crowd, yet it was weekend crowd was much. Menu has Complete punjabi items like breakfast and meal. Ordered one Combo meal, Gobi Parata, Dry fruit Lassi, Pepsi Masala soda and Assorted starter. Everthing was on time, Hot served. Combo was something intresting with all types of items in the plate. Dry fruit Lassi was so tasty.", 1.0], ["Nice plaxe for breakfast or brunch. Good desi veg punjabi food. Lassi, aloo paratha, chole, dal puris were good. paneer pakora, kheer, bhatura were average. Music system should be improved as we could hardly hear the songs. Light on the pocket and clean as well. Worth atleast a visit.", 4.5], ["ordered food for home delivery paneer do payaza mushroom masala n few parathas... to be honest parsthas was the only thing which was edible.. there was ton of oil dripping down from the box which had to be seprated out. curries had way too much masala... on the whole shitty food not recommended.", 4.0], ["Being a North indian I was searching for dhaba style food in Bangalore and then Kapoor’s Cafe came to the rescue. I ordered many dishes. Really loved the parathas and lassi but i was disappointed with Matra Kulcha. Matra was undercooked and watery. Will surely want to revisit this place specially for the stuffed parathas.", 4.5], ["If you do not know the place and visiting for the 1st time just follow the map or you will be lost..the entrance looks like you are at a dhaba but the ambience is decent...lassi served in a matka with flavour of kesar must have...the best cheese pakodas..mutter paratha was a bit spicy n so filling...kadai paneer was good...the oaneer pulav was a bit oily...heard the fruit Cream is the best desert but we tried the shahi tukda instead and it was good with little less sweet..on yhw whole a good experience", 4.5], ["If you want to have a dhaba kinda taste and without much driving, here's the place within city limits. The only difference you would find from regular dhabas is this place doesn't remain open after 11pm. Located in a small lane after varthur itpl signal with no roads and a deserted parking. Simple table chair seating arrangement. Clean hygienic place, neat kitchen. What else you need from a dhaba like place.Let's talk about food", 2.0], ["delicious food, nice portions, served hot. And the best part is it is PURE VEG. Way to go VEGANs. Cheese pakoda balls are simply finger licking. French Fries Punjabi style are truly Funjabi. Added falvors like chat masala and chilli powder, decorated with fried green chillies. Masala papad is also very tasty though papad is very tiny in size. Pudina khasta paratha is good. Aloo Paratha (with butter, Punjabi portion) rocks. Chilli Onion paratha is the only disappointing dish we had. Fulkas are good. Malai kofta, rajma and paneer lababdar", 4.0], ["tasty and delicious. Though would advise to have spicy paneer like butter masala or kadai paneer. Jeera rice is usual.Buttermilk is tasty. Lassi rocks, deserves for repeat order. Dry fruit lassi is very subjective as it contains too much of cashews and almonds.Sometime bit slow in service, but mostly prompt service. That may be the only reason for no to 5* rating.", 2.0], ["If you want to have a dhaba kinda taste and without much driving, here's the place within city limits. The only difference you would find from regular dhabas is this place doesn't remain open after 11pm. Located in a small lane after varthur itpl signal with no roads and a deserted parking. Simple table chair seating arrangement. Clean hygienic place, neat kitchen. What else you need from a dhaba like place.Let's talk about food", 4.5], ["delicious food, nice portions, served hot. And the best part is it is PURE VEG. Way to go VEGANs. Cheese pakoda balls are simply finger licking. French Fries Punjabi style are truly Funjabi. Added falvors like chat masala and chilli powder, decorated with fried green chillies. Masala papad is also very tasty though papad is very tiny in size. Pudina khasta paratha is good. Aloo Paratha (with butter, Punjabi portion) rocks. Chilli Onion paratha is the only disappointing dish we had. Fulkas are good. Malai kofta, rajma and paneer...", 4.0], ["The most over-hyped restaurant in Whitefield.Really poor food quality...they're not capable of handling the huge influx of crowd usually seen during weekends. The whole place stinks of fat Punjabi dudes sweating and salivating...with one eye on the \"Soni kudi\" waiting outside and other eye on their mobile phone...while loudly reciting the menu card...it's like Navjot Singh Siddhu x 100 .The owner, like any other Punjabi guy...hardly care about the mismanaged situation ...and has a very casual approach to any situation ( Saw some dudes fighting outside...and when informed about it...the owner just said \"O jee...unko keh do thand rakho\" )", 5.0], ["Authentic Punjabi parantha, taste, spices, ambience and kind of flavours used. If you are looking for punjabi parantha, Veg north indian food this is the best place in and around Whitefield. A must visit place and bit crowded during weekends. It is recommened to come bit early to avoid rush. We ordered almost all types of paranthas", 4.0], ["alu, gobhi, mix, khasta, Cheese, cheese burst and paneer. Cheese parantha is a must try as you will not find it easily in another places. Do try matka Lassi with added kesar.", 4.0], ["I have been here for first time with high expectations after reading reviews. To start with good i liked lassi and khasta paratha, though lassi was too sweet by any standard. We ordered Paneer butter masala with no butter/ cream and almost tasteless; worst was the dhaba daal, which was stale and smelly. Also the place is too noisy, if you want a peaceful eve. So overall my experience with the place has been very bad for the first time.👎", 3.0], ["If you love authentic Punjabi food then this is the place for you. Awesome rajma and cheese paratha. Great ambience. Friendly staff and Punjabi songs. A must go place.", 1.0]], "52228": [["Unarguably, the best fine dining north Indian specialty restaurant of the IT city, Punjab Grill has been my favorite since its inception 5 years ago. Known for its quintessential cuisine from the northern region, this place has never disappointed my palate.Recently they hosted a special celebratory to commemorate 5 years of its inception in Bangalore. Celebrity Chef Nishant Choubey was specially flown in from Delhi to prepare 16 course degustation menu for the occasion. For those who are not aware, Chef Choubey was one the 12 select global chefs to be part of Master Chef classes at the World Gourmet Summit in Singapore.Since it was 16 course massive menu, I would like to highlight my favorites from the culinary experience, just keep review short and interesting for all.Fire Roasted Cottage Cheese Served with an Orange Sriracha Marmalade – though the combination may sounds little odd to many, this was one of the best I have ever had. There was perfect marriage of flavors. Must try dish that has elements of Smokey spicy and citrus beautifully imbibed. The Tamarind foam further added to its flavors.Raan – Unmissable roasted lamb leg delicacy here served with toasted almonds and rosemary chutney foam, well done to suite the Indian palate. Mouthwatering indeed.", 5.0], ["Unarguably, the best fine dining north Indian specialty restaurant of the IT city, Punjab Grill has been my favorite since its inception 5 years ago. Known for its quintessential cuisine from the northern region, this place has never disappointed my palate.Recently they hosted a special celebratory to commemorate 5 years of its inception in Bangalore. Celebrity Chef Nishant Choubey was specially flown in from Delhi to prepare 16 course degustation menu for the occasion. For those who are not aware, Chef Choubey was one the 12 select global chefs to be part of Master Chef classes at the World Gourmet Summit in Singapore.Since it was 16 course massive menu, I would like to highlight my favorites from the culinary experience, just keep review short and interesting for all.Fire Roasted Cottage Cheese Served with an Orange Sriracha Marmalade – though the combination may sounds little odd to many, this was one of the best I have ever had. There was perfect...", 5.0], ["We opted this outlet for our team lunch today after a colleague of ours recommended this place having tried their other outlet in another part of the city. The restaurant has a plush ambience and had ample seating available and were able to get a table as soon as we entered. We ordered Paneer Tikka Multani for starters and some Shikanjvi and Aam Panna to go along. The drinks were very refreshing although the Aam Panna was a bit too sweet. We were assured that the Aam Panna was made from real raw mango pulp and not store bought Aam Panna concentrate. The paneer tikka was soft and flavorful although I personally am not a big fan of this dish of Paneer.Next we ordered for Patialashahi Kadai paneer, Rawalpindi chana and Indian bread basket for main course. The Kadai Paneer was mildly spiced and the gravy was again very flavorful with capsicums lending it's unique flavour. The Rawalpindi chana was moderately spicy and very well made with ginger juliennes and freshly chopped coriander as garnish.We couldn't have ignored our sweet tooth and hence ordered quintessential Kulfi and rose flavored Falooda. The Kulfi was not too sweet and had a creamy texture. The servers were attentive and polite. All in all a satisfying lunch except for their food pricing which in comparison to their taste of food is expensive. Here are my final ratings:Ambience: 4/5Food selection: 4/5Taste of food: 4/5Service quality: 4/5", 5.0], ["We opted this outlet for our team lunch today after a colleague of ours recommended this place having tried their other outlet in another part of the city. The restaurant has a plush ambience and had ample seating available and were able to get a table as soon as we entered. We ordered Paneer Tikka Multani for starters and some Shikanjvi and Aam Panna to go along. The drinks were very refreshing although the Aam Panna was a bit too sweet. We were assured that the Aam Panna was made from real raw mango pulp and not store bought Aam Panna concentrate. The paneer tikka was soft and flavorful although I personally am not a big fan of this dish of Paneer.Next we ordered for Patialashahi Kadai paneer, Rawalpindi chana and Indian bread basket for main course. The Kadai Paneer was mildly spiced and the gravy was again very flavorful with capsicums lending it's unique flavour. The Rawalpindi chana was moderately spicy and very well made with ginger juliennes and freshly...", 4.0], ["First time we ordered salmon Tikka...Marvellous....unbelievable taste...good quality and quantity...really superb...that waiters are too polite and super fast delivery,worth for money...all the best.", 4.0], ["Punjab Grill, a fine dining destination located in Koramangala in the heart of restaurant district of Bangalore aims to wow your taste buds with authentic dishes from erstwhile State of Punjab. Their menu serves us a taste of specialities from the kitchens of Lahore, Peshawar, Rawalpindi and Amritsar.                                                                ...", 3.0], ["Nice Ambience, Good Food, Friendly Staff, whatever we ordered was fresh and good in taste, service was quick.Do try the tandoori chicken and tikka.", 4.0], ["Love the authentic punjabi food served at this place. It's our go to comfort food when we order in on a rainy day. Their kababs are awesome and so is their dal Makhni. Biryani is yummy too!", 4.5], ["Ratings out of 10-1.Cost-6.5/102.Ambience-8/103.Service-9/104.Food-8.5/105.Overall-8.5/10Location: this restaurant is facing Forum Mall right across the street. It lies near Standard Chartered Bank, near Kopper Kadai restaurant and Bhima Jewellery. Whooppeezz Pizza is very close to this too. A very busy and bustling area I must say.", 4.0], ["Ratings out of 10-1.Cost-6.5/102.Ambience-8/103.Service-9/104.Food-8.5/105.Overall-8.5/10Location: this restaurant is facing Forum Mall right across the street. It lies near Standard Chartered Bank, near Kopper Kadai restaurant and Bhima Jewellery. Whooppeezz Pizza is very close to this too. A very busy and bustling area I must say.", 5.0], ["The place is good specially the interior an the setup, lighting everything is good.The food is average in taste and the staff is good too but their service is slow.Can improve their service", 4.0], ["It’s been five years since Punjab Grill opened its doors and introduced us Bangaloreans to authentic Punjabi khanna fit for the kings. To commemorate its 5th anniversary, Punjab Grill hosted a special dinner with a 16 course degustation menu(yes you heard me right, 16 courses) called the Punjab Grill Signature Series. Well even though it was degustation menu, with Punjabi food, it’s pure hedonistic in every sense. From ‘utterly butterly’ delicious rotis to sinful starters and the most innovative concoctions to accompany it. I think my tummy even did its own version of a happy dance to the hit number Kaala Chasma😉                                                                ...", 4.5], ["Good service and good food. The buffet offers limited items in main course but starters are many and you won't be disappointed, (both veg and non veg). Do give it a try when you are around kormangla.", 4.5], ["A pretty expensive place but the punjabi food served is delicious. The service was really amazing. A perfect place for family with nice ambience and courteous staff. Tried their rum gulab jamuns.. I must say was mouth watering. A must must try.. The tricks they do with fire on your table, surprises you and the taste of gulab jamun post that rum and fire is heavenly.", 4.0], ["Nice place.. loved the food specially the beetroot peanut tikki, stuffed mushrooms and specially the biryani... The spices in the biryani was perfectly touched the cooking.. perfect place for a perfect evening... :)", 3.5], ["This is definitely the best north Indian food that I have had so far in Bangalore", 3.5], ["would recommend all \"Punjabi by Nature\" fans to try this one out. Amazing palak paneer and tawa veg. The quantities are really good too. Just ordered one naan, and that was good enough for me. I'd say don't try indianised cocktails.. they werent that great. Oh and the pan shot at the end of it was lovely! You don't need to have any dessert.. just ask for one more pan shot. Taste wise, I'd place this restaurant higher than barbecue nation and somewhat similar to Punjabi by Nature.<span></span>", 3.5], ["Punjab Grill, the gourmet fine dining restaurant is the place to go for Bangaloreans looking for a dose of authentic Punjabi food! Their specially crafted menu caters to both the vegetarian and non vegetarian palette. This coupled with the excellent service of the extremely courteous staff made the experience an unforgettable one! Whether it's a family outing or a romantic dinner for two, the ambience is perfect for all occasions and the food is a winner! Taste", 4.5], ["4.5/5Quality", 3.5], ["5/5Ambience", 3.5], ["4.5/5Service", 4.0], ["5/5Overall experience", 3.0], ["5/5", 3.5], ["I feel special occasions can be planned here looking after ambience, seating arrangements , varieties of veg items, fast servicing. We ordered all veg stuffs like paneer Tikka Multani, malai kofta( must try its sweet and spicy ) Everything was very nicely prepared. Cost of all items are a bit higher, but the quantity of curry and starters is sufficient for 3-4 persons. Waiters were quite generous to respond to our concerns. Everywhere you will get a welcome drink, here you will get shots of drinks while you are about to leave. :)", 4.0], ["This place was long due since it's inception in NCR. Went on my birthday with my friends. It was a good experience. Though we had all veg that day, I truely enjoyed it. Little heavy on wallet but can be visited occasionally with friends and family.", 3.5], ["I have been a regular visitor to Punjab Grill, Gurgaon outlet. And a great fan of that place. So I was already having high hopes from this place in Koramangala also. And frankly I wasn't disappointed!I went to this place for celebrating my birthday, I liked their ambience. Pretty classy and chic Dim lights, nice sofas! I have always been a great fan of their dahi k kebabs....I just loved them...must order dish if you are here...But yea on my birthday, we ordered chicken and by mistake they served prawns. Which is definitely BIG blunder! Though I am a vegetarian but a friend of mine who ordered chicken were totally pissed off with them..She even had an allergy from prawns ...but they apologized and did everything they could do to compensate that! They brought us some complimentary sweet dish! But what could have been a pathetic exp didn't turn out that way. Their staff is pretty humble and north Indian food is also awesome! Their daal makhani is delicious and overall great food!So you can consider this place for north Indian food in Koramangala!", 4.5], ["I have been a regular visitor to Punjab Grill, Gurgaon outlet. And a great fan of that place. So I was already having high hopes from this place in Koramangala also. And frankly I wasn't disappointed!", 5.0], ["This place is located in Koramangala. The first thing you would notice about this place is that it has a very big dining space including open air options. The restaurant has a classy decor with different table options", 4.5], ["sofa, 2 persons, 4 persons, 6 persons..so on so forth. Dim lights and nicely done interiors. It has a live bar.The black uniformed staffs are quite efficient and suggestive. Given the fact that we went in around 10pm on a Friday night with quite many customers the service was very prompt as they has lot of staffs...We ordered:Plain NunMakki Di RotiChicken Lababdar", 4.0]], "51490": [["I had been to this place yesterday. It was a sudden plan though. So I got go find this restuarant on the way. This place has a cute Rajasthani ambience. The waiters are friendly. We ordered baby corn pepper dry .. which I liked the most. We also ordered palak paneer. Which was good enough. They have amazing daal baati thali too.", 3.5], ["If you want to enjoy bland food with no noise around then Dal Tadkaa is the place. Authentic Rajasthani fare with a wide variety of food. Sarson ka saag (seasonal), all types of rotis and mithai are must try. A place worth visiting for those looking for a changeAmbience: 3.5Food: 3.5Service: 4", 3.5], ["We visited Dal Tadka on a weekday. The overall experience of dining at Dal Tadka is average to above average. Considering that the price for the buffet is reasonable, your expectations too are toned down. The food does taste good and is also helped with courteous service. The lack of too many dishes also lets you pick what you want to eat and have your fill. Malpua is made too thick and thus not crispy. Ironically, the dal tadka and ghee rice are not too tasty. But, the overall experience is pleasant.Good place to dine if you are in Banashankari area.", 3.0], ["I had heard a lot about this restaurant hence I went to try it out.I was disappointed. The pulkas were dry ,the sabzi tasteless,the tikki undercooked and the veg pulav didn't have a balance of masalas.The ambiance of the restaurant was good but what's a restaurant worth without good food. We decided never to visit again.", 1.0], ["Ordered home delivery. The food was delivered on time and delivery guy was courteous. But the food was equally bad. Palak panner had no taste and panner was not at all fresh. Veg pulao was also very bad had no taste or spice. I dont think i would like to order again unless i see reviews of improvement.", 1.5], ["Now it's not very fair to review this restaurant now as it's been a very long time the last time I was there.  But I do remember it so here it goes! It was on a weekend for a buffet lunch. Variety is normal like everywhere else but the service was quite good. There wasn't much in terms of desserts but hey for that price we didn't expect much as well. A place that you can skip without worrying of missing something!", 3.0], ["ordered paneer butter masala and rotis and naans for home delivery ... the breads were well packed but the gravy was hugely disappointing ... i had stomach uneasiness for hours after eating the food meaning its old or rotten food ... totally unhealthy and not worth it if they cant make a simple gravy ... i can only imagine how the remaining items are", 1.5], ["Very highly priced restaurant. Food is not good both quantity and quality wise. Just that the interiors they have made differently which no where impress.", 2.5], ["Okay, I'm never really cruel enough to be rating a restaurant 1.5, but this one deserved it. First and foremost, I want to express condescending shock and disappointment for the lack of courtesy and civility of the staff and management of this hotel. Linguistic/Community discrimination was rampant here. So, my friend and I, who're south Indians casually walk in, conversing in Kannada, our mother tongues, and were treated like insignificant creatures. We ordered 2 Rotis and a curry and waited for the longest 45 minutes of our lives. Two other tables of North Indian folk conversing in Hindi and Marathi respectively, who arrived after us were served much before us (For the record, I have a lot of North Indian friends and have nothing against them!) . We ran out of patience when the other two tables were ready for dessert and we were still waiting for the damn roti and curry. The bias display was pretty clear. We finally lost it and confronted the manager, who seemed to understand our predicament and offered a complimentary dish, which our bruised egos obviously repudiated. We left after giving a piece of mind to the management who're making money off Bangaloreans, but refuse to interact in the local language and treat customers differently, leaving the overdue Rotis untouched. I'm never going back in there and wouldn't recommend it. I was obviously too pissed to be taking notice of the ambience. Super disappointed!", 1.5], ["Okay, I'm never really cruel enough to be rating a restaurant 1.5, but this one deserved it. First and foremost, I want to express condescending shock and disappointment for the lack of courtesy and civility of the staff and management of this hotel. Linguistic/Community discrimination was rampant here. So, my friend and I, who're south Indians casually walk in, conversing in Kannada, our mother tongues, and were treated like insignificant creatures. We ordered 2 Rotis and a curry and waited for the longest 45 minutes of our lives. Two other tables of North Indian folk conversing in Hindi and Marathi respectively, who arrived after us were served much before us (For the record, I have a lot of North Indian friends and have nothing against them!) . We ran out of patience when the other two tables were ready for dessert and we were still waiting for the damn roti and curry. The bias display was pretty clear. We finally lost it and confronted the manager, who seemed...", 1.5], ["Its a good restaurant for a calm and peaceful dine out!Although the ambience is not very wow.Food is still OK!U can drop in her once a while", 3.5], ["The food is very ordinary. No special Rajasthani touch to it. The quantity is very less but pretty expensive for the ambience. Not recommended.", 1.0], ["Never step into this restaurant, if you do it by mistake, never take buffee lunch or dinner, you will get butter milk as welcome drink, vade and bonda as starters, tastless panner curry, roti/kulcha, tasteless jira rice, plain rice, sambar and curds, you get stupid kesari bath as sweet and a spoon of ice cream in plastic disposible cup for RS.280, better go to any other restaurant have a full north indian meals, which is better.", 1.0], ["Rajastani themed restaurant. They have many branches all over Bangalore. Buffet is available. Food was really bad. It was cold. The soup served was tasteless. Bad service.", 2.5], ["Happened to visit this restaurant with my friends. We opted buffet dinner which had quite a decent menus.They don't serve soups instead they have a welcome drink which was very tasty. Starter and salads were quite good. In main course they had only one gravy and a daal. Which was quite disappointing. Phulkas were not smooth enough.  They really need to improve desert quality and menu.", 3.0], ["The buffet is inr 330 pp all incl. But the quality is very mediocre, so is the variety. Daal baati didn't feel like one... I could eat, but at that price range, you can definitely hang in domino's and get a d cheese burst full in your mouth :p", 2.0], ["This place is on the first floor near kathriguppe signal. Visited this place for lunch, they had a board that said spl buffet. There was nothing special about it. The usual north indian thali, only served buffet style, which cost us 340/head. I felt it wasn't worth that much. Food was ordinary. Service isn't very good (when u ask for salt, the server says it is on the other table madam please take it 😐 )Food: 2.5/5Ambiance: 3/5Service: 2/5Price: 2/5", 2.5], ["I tried the one located in Banshankari, third stage.. Food was amazing, my expression was it has to be Veg restaurant but it was not at all only Veg. Food was spicy and absolute pleasure to eat.", 3.5], ["Have been staying in near by area for last 15 years. Dal Tadka inserted a pamphlet in the newspaper indicating the prices and the offers. Visited the place and to the astonishment there is a difference in the prices published on the pamphlet and the Menu in the Restaurant. On enquiring with the Manager, the reason given is the prices in the insertions in the newspaper is for home delivery. Totally confusing and misleading information by the management to pull crowd. Nowhere it is mentioned that its for home delivery. Tried reaching the owner but couldn't get his contact details. Don't want to comment of food as the primary objective of being transparent has been defeated.Would never advise my acquaintances to even try the place.", 2.5], ["Too expensive and ordinary food...not so tasty...takes a lot of time for preparation and menu is least..yummy. I don't want to go again. Rice is somewhat like half cooked", 1.5], ["A normal Rajasthani place. Not great but not too bad either . Malai loft ha was disappointing. Hara bara kebab and tomato soup was good. One time visit", 2.5], ["Dangerous restaurant. Please dont visit. wonder how this place was almost full even after bad real bad food....after eating buffet there we all got sick. head spin, stomach upset, stomach infection all together. 6 of us went n all 6 of us r terribly sick. missed our college n offices......PLEASE DO NOT VISIT. FOR UR HEALTH SAKE.", 1.0], ["Its a five minute walk from home, and yesterday I decided to go for dinner", 3.0], ["a la carte. The place is neat and decently well maintained. Ordered ghee rice, dal fry and a sweet lassi. I wouldn't say the food is bad, but is prepared way too bland. Taste wise they are OK, and lassi was thick and tasty. Price is relatively high for the quantity of food which is served. Would recommend to people who prefer eating bland and non-spicy 100% vegetarian food., but otherwise, you can skip Dal Tadkaa.Ambiance", 1.0], ["3.5 / 5Service", 1.0], ["3.5 / 5Food", 2.5]], "58818": [["After a long long time, I am giving some place as 5 rating! But believe me it's worth it! I just haven't ate waffles like there's! Atleast not in India! Crispy, fresh, perfectly sweet and awesome toping. Great place specially for people having sweet tooth.", 5.0], ["Had one of their famous Nutella Waffles... I might be over my head to say thay I expected more from them after reading such good reviews... All I will say that I have had better waffles... But many people like them so you can definitely try them... Try with Ice Cream....", 3.5], ["There is no seating area as such. My friends and I had the Chocolate Belge waffle, standing in the crowded corridor. Waffles were pretty salty in comparison to what I have tried in some cafes in the city.", 3.0], ["Best #waffles in the town. Wow, just lip smacking. Finest place to finish your evening with dessert in pheonix mall. They make it beautifully. Reasonable price according to quality. It is a shop/counter which has 6-7 chairs. Overall loved it.", 4.0], ["Loved it ...best waffles eaten ever...Maple and icecreams is the best combination ever....", 5.0], ["This is a small place in Phoenix but has the best waffles in town. It is a small outlet to getting a place to sit is a bit tough. Maybe they can increase the size of the outlet.", 4.5], ["Waffles lovers must try this place ! Fresh baked waffles and the hot melted sauce with sugar icing ! Perfect after a meal. Well this is a small place so you cannot expect to get a place to sit there and have your waffle, rather you can grab n go!", 3.5], ["This outlet at Phoenix mall is tiny, but it's the best waffles around. The presentation of the waffle is very much appreciated. Waffles lovers will relish, but wish the menu had more options. We are very limited to a few and the seasonal fruits sometimes not available.In all you may try this and enjoy.", 4.0], ["My all time favourite waffle place, number one among what so all other brands available in market. I am a very frequent visitor and I love visiting this place again and again.. everything is topnotch, customer service, waffles and the place too.", 5.0], ["After my first visit to this place i have become a waffle lover. Till now I visited this place many times and have tried almost all the combination of waffles with different toppings and my fav ones are Go Banana with Caramel Sauce and Go Nuts with Ice-cream.", 4.5], ["In love with this place! I usually am not a big fan of waffles but they give amazing ones!. We tried the chocolate truffles one . It was a crunchy waffle with a lot of icing sugar and chocolate spread they then poured ice cream and whipped cream on it and hot chocolate sauce . It was an amazing dish z I plan to go here every weekend", 4.5], ["The waffles were great and it's a really nice outlet to have a casual talk and indulge into your sweet cravings. I would recommend it to people who would love to try this dessert.", 3.5], ["It goes by its name. The waffles are absolute yum. I tried the Nut Cracker and it was worth it. Waffles with cream in top with nuts. Would love to try the other flavors. Great place.", 4.5], ["Updated : The Maple syrup and banana combination is also amazing. Its light, crispy and totally worth trying *********************************", 5.0], ["The best place for waffles ! I always ensure that I stop by Belgyum every time I drop in at Phoenix. I have been here a lot number of times. Though I have always wanted to try the different flavors they offer, I end up getting the nutcase every single time. I'm totally in love with nutcase. So, that gives me an excellent excuse to get back there every time, in the hope to try a different combination the next time as well as their shakes.Kudos to the belgyum team :)", 4.5], ["The name is definitely innovative and if you are a waffle lover like me, this place is going to be on your list. However, personally for me, it didn't live up to the hype. I don't really mind the limited number of options in waffles n the toppings but the taste was quite ordinary. I asked for the chocolate topping and it overpowered the waffle. All I could taste was an overload of chocolate sauce with not so tasty bits of waffle! I have had much better. I am not ruling out the place. Would probably try again. Love the concept but they need to work on the dish itself and the proportion of the toppings.", 3.0], ["I just love their waffles. 😍Whenever I visit phoenix, I always end up having their waffle go banana with nutella and vanilla ice cream, it's so wow.I wish they had their outlet here in Mumbai as well.", 4.5], ["Tried 1st time... But simply loved it.Will visit to try different options from menu.Had Nutella waffle that was really good... Next time will go with toppings ;)", 4.5], ["This place serves tastiest waffles i have ever eaten. Their waffles are tasty and crispy and just melts in your mouth. Nuttela waffles are just heavenly and a must try", 4.5], ["Undoubtedly this place serves one of the best waffles in the city.Made fresh and served fresh.Little Crispy and crunchy.", 4.5], ["I am a waffles fan and in the food court of Phoenix mall this was the only interesting food stall.as all others are available in Orion and mantri mall. There was quite a lot of rush and there were quite a few combinations to choose from. You have different sauces to choose from like maple, nutella, chocolate, blueberry, raspberry, strawberry, etc. Then you have different toppings like nuts, fruits, etc. After thinking long and hard I decided to try winter surprise which was waffle with powder sugar, strawberry sauce and whipped cream. The waffle was baked well and tasted really good with strawberry sauce and whipped cream. Prices are reasonable. Hope it opens in other malls as well!", 4.5], ["The bestest place to have the yummiest waffles!!Customize and be creative with your waffles or go with what's listed on the menu..you will love it either ways!The waffles are fresh and well made and the toppings and sauces are perfect..try everything you can on their menu and you will be surprised how each new preparation delights you every time :)", 5.0], ["I sneaked in to this place while my wife was busy shopping. This place has the highest rating in Whitefield and now was the real test of zomato rating system..:)There were quite a lot of people and it took a while for my number to arrive.  Since I was alone, I ordered only 1 Banana Nutella waffle. It was hot and nice. The taste was yum and left me wanting for 1 more.", 5.0], ["Not sure why this place is so crazily highly rated. It's just a solid waffle place, so-so value for money. Should offer more options, like flavored waffles (chocolate, chocolate chip, could also have pumpkin, peanut butter, etc.). Pretty average range of toppings too.", 3.5], ["Nice waffles, but not the best I've had in Bangalore. Love the pun in the name, though. Nutella waffles with ice cream and chocolate sauce for the win! The whipped cream tastes milky, so I didn't like it.", 4.0], ["Initially when I went here .... I was literally confused. Is this waffle is enough of me ? or will it be able to fill my stomach? leave stomach will it be good in taste or worth spending single Penny over it? 15mins later my all Questions were answered.", 4.5], ["Belgyum's like those umpteen flats and houses with their gates and parking areas encroaching upon the road that go in front. There was a reason the space was built the way it was, but these morons conveniently choose to extend their briefs, quite literally. So don't be surprised when you see people hustling and busting in front of Belgyum", 1.0], ["that's where people stuff their faces with the ice cream laden waffles, besides hopping left and right to make way for the traffic passing through. Who says sorry when the ice cream rubs on to that rushing shirt is a matter for another day. You could have ignored all of this in a mall like Phoenix, where only one lift works on weekdays despite people queueing up, had the food been great. Ordinary ice creams on a waffle and not in it, could have probably worked at half the price at which they're dishing it out; it certainly didn't impress any of us. All we do now, is take the bypass route to Berry'd Alive or Creame and Fudge", 1.0], ["dessert joints that score heads and shoulders above this one and have seating that doesn't spill over intentionally.", 3.0], ["Belgyum's like those umpteen flats and houses with their gates and parking areas encroaching upon the road that go in front. There was a reason the space was built the way it was, but these morons conveniently choose to extend their briefs, quite literally. So don't be surprised when you see people hustling and busting in front of Belgyum", 4.5], ["that's where people stuff their faces with the ice cream laden waffles, besides hopping left and right to make way for the traffic passing through. Who says sorry when the ice cream rubs on to that rushing shirt is a matter for another day. You could have ignored all of this in a mall like Phoenix, where only one lift works on weekdays despite people queueing up, had the food been great. Ordinary ice creams on a waffle and not in it, could have probably worked at half the price at which they're dishing it out; it certainly didn't impress any of us. All we do now, is take the bypass route to Berry'd Alive or Creame and Fudge -...", 4.0]]}